[
    {
        "title": "Towards workflow ecosystems through standard representations",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "ABSTRACT Workflows are increasingly used to manage and share scientific computations and methods. Workflow tools can be used to design, validate, execute and visualize scientific workflows and their execution results. Other tools manage workflow libraries or mine their contents. There has been a lot of recent work on workflow system integration as well as common workflow interlinguas, but the interoperability among workflow systems remains a challenge. Ideally, these tools would form a workflow ecosystem such that it should be possible to create a workflow with a tool, execute it with another, visualize it with another, and use yet another tool to mine a repository of such workflows or their executions.  In this paper, we describe our approach to create a workflow ecosystem through the use of standard models for provenance (OPM and W3C PROV) and extensions (P-PLAN and OPMW) to represent workflows.  We introduce WEST, a workflow ecosystem that integrates different workflow tools with diverse functions (workflow generation, execution, browsing, mining, and visualization) created by a variety of research groups. This is, to our knowledge, the first time that such a variety of functions and systems are integrated. Categories and Subject Descriptors C. Computer systems organization, D.2 Software engineering, D.2.10 Design.  General Terms Management, Documentation, Design, Reliability, Standardization. Keywords Scientific workflows, workflow ecosystems, interoperability, OPMW, PROV, P-Plan, WINGS.  1. INTRODUCTION The interoperability of workflow systems is an active area of research, including standard languages for representing workflow executions as provenance [24] [18], integration efforts that demonstrate the exchange of workflows across different systems [21] [17], and architectures with a modular design that can integrate alternative systems such as alternative execution engines [13].  As workflow technologies continue to mature, new tools are being developed with new functions that address different requirements for workflows, including design [26] [19] [11] [30] [25], validation [11], execution [5] [30] [25] [23], visualization [25] [11] [26], and mining [10] [14] [29].  The interoperability of all these different workflow tools remains an open research area. Ideally, given some requirements for an application it would be easy to assemble an end-to-end system out of the workflow tools available. Another scenario for interoperability is supporting users that have new requirements over time.  For example, a user could execute workflows with a particular a tool for many months and then later want to import all the workflow runs into another tool ",
        "publication_date": "2014-01-01",
        "authors": "Daniel Garijo Verdejo, Yolanda Gil, Óscar Corcho",
        "file_name": "20250512001235.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/west-works14/PDFs/20250512001235.pdf",
        "pdf_link": "https://dgarijo.com/papers/west-works14.pdf"
    }
]