[
    {
        "title": "T2WML: Table To Wikidata Mapping Langauge",
        "implementation_urls": [
            {
                "identifier": "https://github.com/usc-isi-i2/t2wml",
                "type": "git",
                "paper_frequency": 4,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": null,
        "arxiv": null,
        "abstract": "ABSTRACTThe web contains millions of useful spreadsheets and CSV files, butthese files are difficult to use in applications because they use awide variety of data layouts and terminology. We present Table ToWikidata Mapping Language (T2WML), a language that makes iteasy to map and link arbitrary spreadsheets and CSV files to theWikidata data model. The output of T2WML consists of Wikidatastatements that can be loaded in the public Wikidata knowledgebase or in a Wikidata clone repository, creating an augmentedWikidata knowledge graph that application developers can queryusing SPARQL.1CCS CONCEPTS• Information systems→Extraction, transformation and load-ing.KEYWORDSKnowledge Graphs; RDF; Entity Linking; WikidataACM Reference Format:Pedro Szekely, Daniel Garijo, Divij Bhatia, JiashengWu, Yixiang Yao and JayPujara. 2019. T2WML: Table ToWikidata Mapping Langauge. In Proceedingsof the 10th International Conference on Knowledge Capture (K-CAP ’19),November 19–21, 2019, Marina Del Rey, CA, USA. ACM, New York, NY, USA,4 pages. https://doi.org/10.1145/3360901.33644481 INTRODUCTIONThe web contains millions of useful spreadsheets and CSV files,including data from many government and international organi-zations. Most institutions offer their data in web sites where userscan download the data in Excel and CSV formats. The downloadeddata is seldom directly usable because, unlike databases (which useone column per variable), spreadsheets often arrange the data indifferent layouts.Fig. 1 illustrates the problem using data downloaded from theUnited Nations web site2 about homicide rates in different countries.We truncated and colored the files for ease of presentation. Thecells with the homicide numbers are highlighted in green, the cells1This material is based upon work supported by United States Air Force under ContractNo. FA8650-17-C-7715.2https://dataunodc.un.org/crime/intentional-homicide-victimsPermission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than ACMmust be honored. Abstracting with credit is permitted. To copy otherwise, or republish,to post on servers or to redistribute to lists, requires prior specific permission and/or afee. Request permissions from permissions@acm.org.K-CAP ’19, November 19–21, 2019, Marina Del Rey, CA, USA© 2019 Association for Computing Machinery.ACM ISBN 978-1-4503-7008-0/19/11. . . $15.00https://doi.org/10.1145/3360901.3364448that provide contextual information for the value are highlightedin blue, and header cells are highlighted in dark blue. Fig. 1a shows",
        "publication_date": null,
        "authors": "",
        "file_name": "20250512002725.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/t2wmlKCAP2019/PDFs/20250512002725.pdf",
        "pdf_link": "https://dgarijo.com/papers/t2wmlKCAP2019.pdf"
    }
]