[
    {
        "title": "WDPlus: Leveraging Wikidata to Link and Extend Tabular Data (short paper).",
        "implementation_urls": [
            {
                "identifier": "https://github.com/usc-isi-i2/t2wml",
                "type": "git",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": null,
        "arxiv": null,
        "abstract": "ABSTRACTScientific observations and other open data are usually made avail-able online in a tabular manner as CSVs and spreadsheets. However,users of these data face three main challenges when attempting touse these products: finding which datasets are related to a topic ofinterest; determining which existing information can be used toextend a given dataset; and how to share their integrated datasetresults with the rest of the community. In this paper we presentWDPlus, a framework designed to address these challenges byleveraging Wikidata. WDPlus allows searching for heterogeneousdatasets, facilitates completing tabular data usingWikidata and pro-poses a mechanism to extend Wikidata in a decentralized manner.KEYWORDSKnowledge Graphs, Entity Linking, Wikidata, RDF1 INTRODUCTIONToday, data about any domain can be found on the web in datarepositories, web APIs and millions of spreadsheets and CSV files.These data comes in a myriad of formats, layouts, terminology andcleanliness that make them difficult to integrate together.Users of these data face three main challenges. The first one isfinding datasets related to a feature or topic of interest. For example,climate scientists often look for years of observational data fromauthoritative sources when estimating the climate of a region. Thesecond challenge is how to complete a given dataset with existingknowledge: machine learning applications are data hungry andrequire asmany data points and features as possible to improve theirpredictions, which often requires integrating data from differentsources. The final challenge is sharing integrated results: onceseveral datasets have been merged together, how to make themavailable to the rest of the community?Knowledge graphs have become the preferred technology to ad-dress these challenges. Large organizations, including search engineproviders, shopping giants and finance institutions are investing inlarge knowledge graphs to integrate and retrieve heterogeneousdata. However, data integration pipelines are usually created man-ually, require significant expertise, and are seldom available to thegeneral public. Similarly, linking to existing datasets in the theLinked Open Data Cloud1usually requires the expertise of a knowl-edge engineer to properly identify the appropriate target instancesto link to in other datasets.1https://lod-cloud.net/Copyright ©2019 for this paper by its authors. Use permitted under Creative CommonsLicense Attribution 4.0 International (CC BY 4.0).Recent initiatives such as Data.world,2Google data search [2]and DataCommons",
        "publication_date": "2019-01-01",
        "authors": "Daniel Garijo, Pedro Szekely",
        "file_name": "20250512002848.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/short4/PDFs/20250512002848.pdf",
        "pdf_link": "http://ceur-ws.org/Vol-2526/short4.pdf"
    }
]