[
    {
        "title": "The Research Object Suite of Ontologies: Sharing and Exchanging Research Data and Methods on the Open Web",
        "implementation_urls": [
            {
                "identifier": "https://github.com/wf4ever/ro-manager",
                "type": "git",
                "paper_frequency": 1,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://github.com/wf4ever/ro",
                "type": "git",
                "paper_frequency": 1,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": null,
        "arxiv": null,
        "abstract": "AbstractResearch in life sciences is increasingly being conducted in a digital and online environment. In particular, lifescientists have been pioneers in embracing new computational tools to conduct their investigations. To support thesharing of digital objects produced during such research investigations, we have witnessed in the last few years theemergence of specialized repositories, e.g., DataVerse and FigShare. Such repositories provide users with the meansto share and publish datasets that were used or generated in research investigations. While these repositories haveproven their usefulness, interpreting and reusing evidence for most research results is a challenging task. Additionalcontextual descriptions are needed to understand how those results were generated and/or the circumstances underwhich they were concluded. Because of this, scientists are calling for models that go beyond the publication ofdatasets to systematically capture the life cycle of scientific investigations and provide a single entry point to accessthe information about the hypothesis investigated, the datasets used, the experiments carried out, the results of theexperiments, the conclusions that were derived, the people involved in the research, etc.In this paper we present the Research Object (RO) suite of ontologies, which provide a structured container toencapsulate research data and methods along with essential metadata descriptions. Research Objects are portableunits that enable the sharing, preservation, interpretation and reuse of research investigation results. The ontologieswe present have been designed in the light of requirements that we gathered from life scientists. They have been builtupon existing popular vocabularies to facilitate interoperability. Furthermore, we have developed tools to support thecreation and sharing of Research Objects, thereby promoting and facilitating their adoption.Key words: Scholarly communication, Semantic Web, Ontologies, Provenance, Scientific Workflow, Scientific Methods.? The Research Object Ontologies have been devel-oped under the aegis of the EU Wf4Ever project (http://www.wf4ever-project.org).Preprint submitted to Arxiv 4 February 2014arXiv:1401.4307v2  [cs.DL]  3 Feb 20141. IntroductionResearch in life sciences is increasingly digital[25,11]. Life scientists have been pioneers in embrac-ing new computational tools to conduct their inves-tigations. For example, they have adopted scientificworkflows as a means for designing and automatingthe execution of their in silico experiments [24].Life scientists are also one of the main adopters and",
        "publication_date": "2014-01-17",
        "authors": "Khalid Belhajjame, Jun Zhao, Daniel Garijo, Kristina Hettne, Raúl Palma, Óscar Corcho, José-Manuel Gómez-Pérez, Sean Bechhofer, Graham Klyne, Carole Goble",
        "file_name": "20250512001150.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/ro/PDFs/20250512001150.pdf",
        "pdf_link": "https://dgarijo.com/papers/ro.pdf"
    }
]