[
    {
        "title": "Web Semantics: Science, Services and Agents on the World Wide Web",
        "implementation_urls": [
            {
                "identifier": "https://github.com/usc-isi-i2/wd-quality",
                "type": "git",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": null,
        "arxiv": null,
        "abstract": "insights about these violations, and abstracting them into findingsand recommendations.21Recently, Wikidata has started moving beyond individual prop-erty constraints, representing a higher-level notion of quality inthe form of shapes that are meant to provide norms of well-formedness for sub-graphs describing concepts of interest [7],e.g., human.22 These shapes are collected as Schemas.23 Eachschema defines the desired sub-graph topology describing a givenconcept, using ShEx shape expressions [7]. Schemas are definedthrough consensus among specific communities (e.g., molecularbiology, software engineering, etc.) interested in standardizingconcepts relevant to them.24 We have not addressed the anal-ysis of Wikidata at this level of abstraction; but the approachdescribed in this work can be naturally extended in this direction.A similar observation can be made about prior work that encodesWikidata constraints based on the multi-attributed relationalstructures (MARS) [25], a formal data model for generalizedproperty graphs devised by Marx et al. [26].Recognizing the complexity of the class and type hierarchy inWikidata, the authors of YAGO4 hand-crafted a new, principledtype hierarchy for Wikidata, specifying constraints in SHACL25and OWL [27]; and running scripts to synthesize YAGO by in-gesting the data from Wikidata and processing the SHACL ex-pressions. YAGO4 defines constraints on domain and range, dis-jointness, functionality, and cardinality. The authors report thatenforcing these constraints leads to a removal of 132M state-ments from Wikidata, i.e., 28% of all facts. The constraints definedby YAGO4 overlap partially with the constraints in Wikidata stud-ied in this paper. Subsequent work should compare the findingsfrom validating constraints in YAGO4 and Wikidata, and it shouldgeneralize the in-depth analysis done in this paper to other KGslike YAGO4.Rashid et al. [28] investigated the evolution of 10 classes fromDBpedia over 11 of its releases, measuring aspects of: persis-tence, consistency, and completeness. This effort resembles our18 https://www.wikidata.org/wiki/Wikidata:Primary_sources_tool#References.19 https://www.wikidata.org/wiki/Wikidata:ORES.20 https://www.wikidata.org/wiki/Help:Property_constraints_portal.21 For more information about data quality tools integrated in Wikidata, werefer the reader to: https://www.wikidata.org/wiki/Wikidata:WikiProject_Data_Quality and https://docs.google.com/presentation/d/1rwjqzPaHTsXNNqDc2Op1-qSbcFyaFwOSnkEkStp5L3E/edit.22 https://www.wikidata.org/wiki/EntitySchema:E10.23 https://www.wikidata.org/wiki/Wikidata:WikiProject_Schemas.24 https://www.wikidata.org/wiki/Wikidata:Database_reports/EntitySchema_directory.25 https://www.w3.org/TR/shacl/.https://wikidata-game.toolforge.org/distributed/#https://www.wikidata.org/wiki/Wikidata:Primary_sources_tool#Referenceshttps://www.wikidata.org/wiki/Wikidata:ORES",
        "publication_date": "2009-01-01",
        "authors": "Elsevier Sdol",
        "file_name": "20250511235602.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/a_study_wikidata_2022/PDFs/20250511235602.pdf",
        "pdf_link": "https://dgarijo.com/papers/a_study_wikidata_2022.pdf"
    }
]