[
    {
        "title": "Towards human-guided machine learning",
        "implementation_urls": [],
        "doi": "10.1145/3301275.3302324",
        "arxiv": null,
        "abstract": "ABSTRACT Automated Machine Learning (AutoML) systems are emerging that automatically search for possible solutions from a large space of possible kinds of models. Although fully automated machine learning is appropriate for many applications, users often have knowledge that supplements and constraints the available data and solutions. This paper proposes human-guided machine learning (HGML) as a hybrid approach where a user interacts with an AutoML system and tasks it to explore different problem settings that reflect the user’s knowledge about the data available.  We present: 1) a task analysis of HGML that shows the tasks that a user would want to carry out, 2) a characterization of two scientific publications, one in neuroscience and one in political science, in terms of how the authors would search for solutions using an AutoML system, 3) requirements for HGML based on those characterizations, and 4) an assessment of existing AutoML systems in terms of those requirements. CCS CONCEPTS • Human-centered computing KEYWORDS Human-guided machine learning; Automated machine learning (AutoML); Task analysis; Scientific workflows. ACM Reference format: Yolanda Gil, James Honaker, Shikhar Gupta, Yibo Ma, Vito D’Orazio, Daniel Garijo, Shruti Gadewar, Qifan Yang and Neda Jahanshad. 2019. Towards Human-Guided Machine Learning. In 24th International Confer- ence on Intelligent User Interfaces (IUI ’19), March 17–20, 2019, Marina del Rey, CA, USA. ACM, New York, NY, USA, 11 pages. https://doi.org/10.1145/3301275.3302324 1 Introduction In recent years, Automated Machine Learning (AutoML) approaches are making great strides to automatically search for machine learning solutions from a large space of possible kinds of models.  Typically, a solution is created by choosing a model (e.g., random forest, SVM, etc.) and then configuring those models by assigning (hyper)parameter values [1]–[4]. A series of challenges and workshops have led to steadfast improvements [5]. Commercial products are now becoming available that automate machine learning, notably for image classification and select natural language processing tasks [6].  While fully automated model learning is appropriate for many applications, there are many contexts where full automation is not desirable or possible.  This is the case when users have knowledge that supplements the available data, particularly in a scientific research context. An AutoML system would look at a set of instances or images the same whether they are about tumor tissues or ad placements.  However, biologists would bring to bear extensive knowledge about human disease in the development of a machine learning model. Without this knowledge, machine learning ",
        "publication_date": "2019-02-19",
        "authors": "Yolanda Gil, James Honaker, Shikhar Gupta, Yibo Ma, Vito D’Orazio, Daniel Garijo, Shruti P. Gadewar, Qifan Yang, Neda Jahanshad",
        "file_name": "20250512002706.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/iui2019/PDFs/20250512002706.pdf",
        "pdf_link": "https://dgarijo.com/papers/iui2019.pdf"
    }
]