[
    {
        "title": "Extending DCAM for metadata provenance",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "AbstractThe  Metadata  Provenance  Task  Group  aims  to  define  a  data  model  that  allows  for  makingassertions  about  description  sets.  Creating  a  shared  model  of  the  data  elements  required  todescribe an aggregation of metadata statements allows to collectively import,  access, use andpublish facts about the quality, rights,  timeliness, data source type, trust situation, etc.  of thedescribed statements. In this paper we outline the preliminary model created by the task group,together with first examples that demonstrate how the model is to be used.Keywords: metadata; provenance; DCAM; model1.  IntroductionThe rise of the Web of Data during the last few years has increased the amount of informationavailable for users in a wide range of domains: digital libraries, scientific workflows, or socialnetworks among others. In order to provide high quality content to users, content providers havestarted to pay more attention to the provenance of their content: where does it come from, whocreated it, or how was it modified by other sources to produce its current version?1.1.  MotivationMany vocabularies and specifications have been developed for representing provenance, but nocommonly accepted standard or official recommendation has emerged yet. The W3C ProvenanceIncubator Group1 was launched in September 2009 with the objective of creating a roadmap and astate  of  the  art  report  of  the  current  approaches,  taking  the  first  steps  towards  a  domain-independent standard. The group also analyzed the “gaps” when trying to provide provenancesolutions in different domains (news aggregation2, scientific workflows3 and business contracts4)but  didn’t  analyze  deeply  the  topic  of  the  provenance  of  metadata  itself,  as  well  as  therepresentation of provenance information as metadata together with the described resources.The latter is already practiced in some areas like digital libraries or scientific workflows, butthese approaches are independent of each other and thus use different models and vocabularies.Therefore,  our  motivation  for  a  Dublin  Core  application  profile  for  metadata  provenance  istwofold: Firstly, we want to represent existing metadata provenance information in a simple andunified way that is well suited for an application of Dublin Core. Secondly, we want to enable theprovision of provenance information for Dublin Core metadata in a Dublin Core compatible way.1.2.  Related WorkAn early initiative to define a vocabulary and usage guidelines for the provenance of metadatawas the ACore (Iannella & Campbell, 1999) and, based on it, the proposal (Hansen & Andresen,1  http://www.w3.org/2005/Incubator/prov/wiki/Main_Page2  http://www.w3.org/2005/Incubator/prov/wiki/Analysis_of_News_Aggregator_Scenario3  http://www.w3.org/2005/Incubator/prov/wiki/Analysis_of_Disease_Outbreak_Scenario4  http://www.w3.org/2005/Incubator/prov/wiki/Analysis_of_Business_Contract_Scenario12Proc. Int’l Conf. on Dublin Core and Metadata Applications 20112001) for the DCMI Administrative Metadata Working Group5. The working group finished in2003 and presented the Administrative Components (AC), addressing metadata for the entirerecord, for update and change, and for batch interchange of records (Hansen & Andresen, 2003).Both  initiatives  focused  more  on  the  definition  of  specific  vocabularies  to  describe  theprovenance of metadata. There was not yet a concise model to relate the provenance informationwith the metadata.Later  initiatives  have  focused  more  on  domain-independent  provenance  representation.Vocabularies like OPM (Moreau et. al., 2010), Provenir (Sahoo et. al., 2010) and, more domain-specific,  the  Provenance  Vocabulary  (Hartig,  2009)  allow  for  representing  various  levels  ofprovenance as a hierarchy, but they are agnostic about the resource they are providing provenanceabout. So in the context of metadata, they leave the implementer alone to decide how to identifymetadata as a resource.",
        "publication_date": "2011-09-21",
        "authors": "Kai Eckert, Daniel Garijo, Michael Panzer",
        "file_name": "20250512000908.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/dc2011/PDFs/20250512000908.pdf",
        "pdf_link": "https://dgarijo.com/papers/dc2011.pdf"
    }
]