[
    {
        "title": "ENIGMA and global neuroscience: A decade of large-scale studies of the brain in health and disease across more than 40 countries",
        "implementation_urls": [
            {
                "identifier": "https://github.com/npnl/PALS",
                "type": "git",
                "paper_frequency": 3,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": "10.1038/s41398-020-0705-1",
        "arxiv": null,
        "abstract": "AbstractThis review summarizes the last decade of work by the ENIGMA (Enhancing NeuroImaging Genetics through MetaAnalysis) Consortium, a global alliance of over 1400 scientists across 43 countries, studying the human brain in healthand disease. Building on large-scale genetic studies that discovered the first robustly replicated genetic loci associatedwith brain metrics, ENIGMA has diversified into over 50 working groups (WGs), pooling worldwide data and expertiseto answer fundamental questions in neuroscience, psychiatry, neurology, and genetics. Most ENIGMA WGs focus onspecific psychiatric and neurological conditions, other WGs study normal variation due to sex and gender differences,or development and aging; still other WGs develop methodological pipelines and tools to facilitate harmonizedanalyses of “big data” (i.e., genetic and epigenetic data, multimodal MRI, and electroencephalography data). Theseinternational efforts have yielded the largest neuroimaging studies to date in schizophrenia, bipolar disorder, majordepressive disorder, post-traumatic stress disorder, substance use disorders, obsessive-compulsive disorder, attention-deficit/hyperactivity disorder, autism spectrum disorders, epilepsy, and 22q11.2 deletion syndrome. More recentENIGMA WGs have formed to study anxiety disorders, suicidal thoughts and behavior, sleep and insomnia, eatingdisorders, irritability, brain injury, antisocial personality and conduct disorder, and dissociative identity disorder. Here,we summarize the first decade of ENIGMA’s activities and ongoing projects, and describe the successes and challengesencountered along the way. We highlight the advantages of collaborative large-scale coordinated data analyses fortesting reproducibility and robustness of findings, offering the opportunity to identify brain systems involved in clinicalsyndromes across diverse samples and associated genetic, environmental, demographic, cognitive, and psychosocialfactors.IntroductionThe ENIGMA (Enhancing NeuroImaging Geneticsthrough Meta Analysis) Consortium is a collaboration ofmore than 1400 scientists from 43 countries studying thehuman brain. ENIGMA started 10 years ago, in 2009, withthe initial aim of performing a large-scale neuroimaginggenetic study, and has since diversified into 50 workinggroups (WGs), pooling worldwide data, resources andexpertise to answer fundamental questions in neu-roscience, psychiatry, neurology, and genetics (Fig. 1shows a world map of participating sites, broken down byworking group). Thirty of the ENIGMA WGs focus onspecific psychiatric and neurologic conditions. Four studyQ1different aspects of development and aging. Others studykey transdiagnostic constructs, such as irritability, and theimportance of Q2evolutionarily interesting genomic regionsin shaping human brain structure and function. Central tothe success of these Q3WGs are the efforts of dedicatedmethods development groups within ENIGMA. There arecurrently 12 WGs that develop and disseminate multi-scale and ‘big data’ analysis pipelines to facilitate harmo-nized analyses using genetic and epigenetic data,multimodal (anatomical, diffusion, functional) magneticCorrespondence: Paul M. Thompson (pthomp@usc.edu)Full list of author information is available at the end of the article.© The Author(s) 2020OpenAccessThis article is licensedunder aCreativeCommonsAttribution 4.0 International License,whichpermits use, sharing, adaptation, distribution and reproductionin any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate ifchangesweremade. The images or other third partymaterial in this article are included in the article’s Creative Commons licence, unless indicated otherwise in a credit line to thematerial. Ifmaterial is not included in the article’s Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtainpermission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/.12",
        "publication_date": "2020-03-20",
        "authors": "Paul M. Thompson, Neda Jahanshad, Christopher R. K. Ching, Lauren E. Salminen, Sophia I. Thomopoulos, Joanna K. Bright, Bernhard T. Baune, Sara Bertolín, Janita Bralten, Willem B. Bruin, Robin Bülow, Jian Chen, Yann Chye, Udo Dannlowski, Carolien G. F. de Kovel, Gary Donohoe, Lisa T. Eyler, Stephen V. Faraone, Pauline Favre, Courtney A. Filippi, Thomas Frodl, Daniel Garijo, Yolanda Gil, Hans J. Grabe, Katrina L. Grasby, Tomáš Hájek, Laura K. M. Han, Sean N. Hatton, Kevin Hilbert, Tiffany C. Ho, Laurena Holleran, Georg Homuth, Norbert Hosten, Josselin Houenou, Iliyan Ivanov, Tianye Jia, Sinéad Kelly, Marieke Klein, Jun Soo Kwon, Max A. Laansma, Jeanne Leerssen, Ulrike Lueken, Abraham Nunes, Joseph O' Neill, Nils Opel, Fabrizio Piras, Federica Piras, Merel C. Postema, Elena Pozzi, Natalia Shatokhina, Carles Soriano‐Mas, Gianfranco Spalletta, Daqiang Sun, Alexander Teumer, Amanda K. Tilot, Leonardo Tozzi, Celia van der Merwe, Eus J.W. Van Someren, Guido van Wingen, Henry Völzke, Esther Walton, Lei Wang, Anderson M. Winkler, Katharina Wittfeld, Margaret J. Wright, Je‐Yeon Yun, Guohao Zhang, Yanli Zhang‐James, Bhim M. Adhikari, Ingrid Agartz, Moji Aghajani, André Alemán, Robert R. Althoff, André Altmann, Ole A. Andreassen, David Baron, Brenda Bartnik‐Olson, Janna Marie Bas‐Hoogendam, Arielle Baskin–Sommers, Carrie E. Bearden, Laura A. Berner, Premika S.W. Boedhoe, Rachel M. Brouwer, Jan K. Buitelaar, Karen Caeyenberghs, Charlotte A. M. Cecil, Ronald A. Cohen, James H. Cole, Patricia Conrod, Stéphane A. De Brito, Sonja M. C. de Zwarte, Emily L. Dennis, Sylvane Desrivières, Danai Dima, Stefan Ehrlich, Carrie Esopenko, Graeme Fairchild, Simon E. Fisher, Jean‐Paul Fouché, Clyde Francks",
        "file_name": "20250512003347.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/enigma_global/PDFs/20250512003347.pdf",
        "pdf_link": "https://dgarijo.com/papers/enigma_global.pdf"
    }
]