[
    {
        "title": "Artificial Intelligence for Modeling Complex Systems: Taming the Complexity of Expert Models to Improve Decision Making",
        "implementation_urls": [
            {
                "identifier": "https://github.com/dtarb/TauDEM",
                "type": "git",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": "10.1145/3453172",
        "arxiv": null,
        "abstract": "drought indices), in order to provide variables and abstractions that can convey the state of the system and behavior patterns that are useful to audiences beyond the model developers.  Indices are often statistical in nature and describe deviation from an average condition. For instance, a drought index value of 4 means extreme drought conditions (4 standard deviations from the mean).  • Visualization designs that are useful for a model need to be also captured.  This includes extracting useful variables from the inputs and outputs of the model, and creating appropriate views for visualization (e.g., coarser-grained results, statistical properties, etc.).  Generating proper visualizations may include fetching other data as reference (e.g. fetching historical data in order to compare the model predictions with annual averages).   • Combined results often need to be generated from many model executions, and these combinations are specific to each model.    • Responses that are not directly generated by the model but can be derived from model outputs. Table 4. Glossary of major concepts to describe models. Concept Description Model theories The principles underpinning the design and implementation of the model, including physical laws, biological postulates, chemical reactions, or socioeconomic theories. Model parameters The parameters in the equations that express model theories.  To apply the model to a specific system, model parameters are often adjusted based on the observations collected for that specific system. Model variables The observed or inferred quantities that can be measured or estimated about a complex system to describe its state over time.  A model can have input variables, internal variables, and output variables.     18 Model processes The dynamic drivers that make a system change state and therefore the value of its variables.   Model software A software package that includes many different functions to set up and run a model under a variety of assumptions.  A model software can have different versions. Model configurations A specific invocation function for model software that ensures the inclusion of certain model processes and variables while excluding others. Model set ups The adaptation of a generic model configuration to a specific system, so that model parameters are adjusted to that system based on the observations collected about the system’s past behaviors. Adjustable parameters A parameter of a model whose value affects an input variable, and can be adjusted to explore different situations.  For example, an agriculture model can have an adjustable parameter that sets the crop to weeds ratio (or range thereof) so users can explore different weed growth situations. Interventions Human actions that can change the course of a system’s behavior, and can be explored through the settings of adjustable parameters and input variables.   Model files Files that are inputs to a model or generated by a model, and contain input and output variables as well as model parameters. Table 4 summarizes major concepts to describe models as problem solving components.  The rest of this section provides formal definitions for the terms that are used in our work.  Important modeling processes, such as model calibration, gridding, and sensitivity analysis, are not currently included in our framework.  Model calibration (or parameterization) requires adjusting model parameters so its predictions are consistent with historical data.  Gridding requires setting up spatial grids of a shape (e.g., regular cubes, irregular polygons) and size (e.g., 1 km, 1m) that allow the model to capture the physical environment with adequate granularity. Sensitivity analysis provides information about uncertain the results would be given underdetermined parameter values. These processes can be largely automated, but may require manual ",
        "publication_date": "2021-06-30",
        "authors": "Yolanda Gil, Daniel Garijo, Deborah Khider, Craig A. Knoblock, Varun Ratnakar, Maximiliano Osorio, Hernán Vargas, Tam Minh Pham, Jay Pujara, Basel Shbita, Bình Dương Vũ, Yao‐Yi Chiang, Dan Feldman, Yijun Lin, Hae Jin Song, Vipin Kumar, Ankush Khandelwal, Michael Steinbach, Kshitij Tayal, Shaoming Xu, Suzanne A. Pierce, Lissa Pearson, Daniel Hardesty-Lewis, Ewa Deelman, Rafael Ferreira da Silva, Rajiv Mayani, Armen R. Kemanian, Yuning Shi, Lorne Leonard, S. D. Peckham, Maria Stoica, Kelly M. Cobourn, Zeya Zhang, Christopher Duffy, Lele Shu",
        "file_name": "20250512000337.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/MINT-tiis/PDFs/20250512000337.pdf",
        "pdf_link": "https://dgarijo.com/papers/MINT-tiis.pdf"
    }
]