{"somef_provenance": {"somef_version": "0.9.9", "somef_schema_version": "1.0.0", "date": "2025-05-12 00:18:01"}, "code_repository": [{"result": {"value": "https://github.com/danielskatz/sustaining-research-projects", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "owner": [{"result": {"value": "danielskatz", "type": "User"}, "confidence": 1, "technique": "GitHub_API"}], "date_created": [{"result": {"value": "2016-08-06T17:38:56Z", "type": "Date"}, "confidence": 1, "technique": "GitHub_API"}], "date_updated": [{"result": {"value": "2025-05-02T08:42:19Z", "type": "Date"}, "confidence": 1, "technique": "GitHub_API"}], "license": [{"result": {"value": "https://api.github.com/licenses/cc0-1.0", "type": "License", "name": "Creative Commons Zero v1.0 Universal", "url": "https://api.github.com/licenses/cc0-1.0", "spdx_id": "CC0-1.0"}, "confidence": 1, "technique": "GitHub_API"}, {"result": {"value": "CC0 1.0 Universal\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator and\nsubsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for the\npurpose of contributing to a commons of creative, cultural and scientific\nworks (\"Commons\") that the public can reliably and without fear of later\nclaims of infringement build upon, modify, incorporate in other works, reuse\nand redistribute as freely as possible in any form whatsoever and for any\npurposes, including without limitation commercial purposes. These owners may\ncontribute to the Commons to promote the ideal of a free culture and the\nfurther production of creative, cultural and scientific works, or to gain\nreputation or greater distribution for their Work in part through the use and\nefforts of others.\n\nFor these and/or other purposes and motivations, and without any expectation\nof additional consideration or compensation, the person associating CC0 with a\nWork (the \"Affirmer\"), to the extent that he or she is an owner of Copyright\nand Related Rights in the Work, voluntarily elects to apply CC0 to the Work\nand publicly distribute the Work under its terms, with knowledge of his or her\nCopyright and Related Rights in the Work and the meaning and intended legal\neffect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not limited\nto, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display, communicate,\n  and translate a Work;\n\n  ii. moral rights retained by the original author(s) and/or performer(s);\n\n  iii. publicity and privacy rights pertaining to a person's image or likeness\n  depicted in a Work;\n\n  iv. rights protecting against unfair competition in regards to a Work,\n  subject to the limitations in paragraph 4(a), below;\n\n  v. rights protecting the extraction, dissemination, use and reuse of data in\n  a Work;\n\n  vi. database rights (such as those arising under Directive 96/9/EC of the\n  European Parliament and of the Council of 11 March 1996 on the legal\n  protection of databases, and under any national implementation thereof,\n  including any amended or successor version of such directive); and\n\n  vii. other similar, equivalent or corresponding rights throughout the world\n  based on applicable law or treaty, and any national implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention of,\napplicable law, Affirmer hereby overtly, fully, permanently, irrevocably and\nunconditionally waives, abandons, and surrenders all of Affirmer's Copyright\nand Related Rights and associated claims and causes of action, whether now\nknown or unknown (including existing as well as future claims and causes of\naction), in the Work (i) in all territories worldwide, (ii) for the maximum\nduration provided by applicable law or treaty (including future time\nextensions), (iii) in any current or future medium and for any number of\ncopies, and (iv) for any purpose whatsoever, including without limitation\ncommercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes\nthe Waiver for the benefit of each member of the public at large and to the\ndetriment of Affirmer's heirs and successors, fully intending that such Waiver\nshall not be subject to revocation, rescission, cancellation, termination, or\nany other legal or equitable action to disrupt the quiet enjoyment of the Work\nby the public as contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason be\njudged legally invalid or ineffective under applicable law, then the Waiver\nshall be preserved to the maximum extent permitted taking into account\nAffirmer's express Statement of Purpose. In addition, to the extent the Waiver\nis so judged Affirmer hereby grants to each affected person a royalty-free,\nnon transferable, non sublicensable, non exclusive, irrevocable and\nunconditional license to exercise Affirmer's Copyright and Related Rights in\nthe Work (i) in all territories worldwide, (ii) for the maximum duration\nprovided by applicable law or treaty (including future time extensions), (iii)\nin any current or future medium and for any number of copies, and (iv) for any\npurpose whatsoever, including without limitation commercial, advertising or\npromotional purposes (the \"License\"). The License shall be deemed effective as\nof the date CC0 was applied by Affirmer to the Work. Should any part of the\nLicense for any reason be judged legally invalid or ineffective under\napplicable law, such partial invalidity or ineffectiveness shall not\ninvalidate the remainder of the License, and in such case Affirmer hereby\naffirms that he or she will not (i) exercise any of his or her remaining\nCopyright and Related Rights in the Work or (ii) assert any associated claims\nand causes of action with respect to the Work, in either case contrary to\nAffirmer's express Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n  a. No trademark or patent rights held by Affirmer are waived, abandoned,\n  surrendered, licensed or otherwise affected by this document.\n\n  b. Affirmer offers the Work as-is and makes no representations or warranties\n  of any kind concerning the Work, express, implied, statutory or otherwise,\n  including without limitation warranties of title, merchantability, fitness\n  for a particular purpose, non infringement, or the absence of latent or\n  other defects, accuracy, or the present or absence of errors, whether or not\n  discoverable, all to the greatest extent permissible under applicable law.\n\n  c. Affirmer disclaims responsibility for clearing rights of other persons\n  that may apply to the Work or any use thereof, including without limitation\n  any person's Copyright and Related Rights in the Work. Further, Affirmer\n  disclaims responsibility for obtaining any necessary consents, permissions\n  or other rights required for any use of the Work.\n\n  d. Affirmer understands and acknowledges that Creative Commons is not a\n  party to this document and has no duty or obligation with respect to this\n  CC0 or use of the Work.\n\nFor more information, please see\n<http://creativecommons.org/publicdomain/zero/1.0/>\n", "type": "File_dump"}, "confidence": 1, "technique": "file_exploration", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/LICENSE"}, {"result": {"value": "*Sometimes, projects offer an identical codebase with two different licenses: one that is commercially-friendly, and one that is less so (ex. GPL). The latter is free for anyone to use, but companies pay for the commercial license in order to have legal peace of mind.*\n\n#### Pros\n* Business model aligned with something people are willing to pay for\n* Can scale well if successful\n\n#### Cons\n* Can be at odds with making software freely accessible\n* Project needs to be big enough that customer need exists\n\n#### Case Studies\n* [MySQL](http://www.mysql.com/about/legal/licensing/oem/)\n* [Sidekiq](http://sidekiq.org/products/pro)\n* [SQLite](https://www.sqlite.org/copyright.html)\n", "type": "Text_excerpt", "original_header": "Dual License", "parent_header": ["Table of Contents"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"value": "This guide is available under the Creative Commons CC0 1.0 License, meaning you are free to use it for any purpose, commercial or non-commercial, without any attribution back to me (public domain).\n\n---\n", "type": "Text_excerpt", "original_header": "License and attribution", "parent_header": ["Table of Contents", "Trademark licensing &amp; franchising"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"value": "* Okoli, Chitu and Nguyen, An, Business Models for Free and Open Source Software: Insights from a Delphi Study (August 15, 2015). Proceedings of the 21st Americas Conference on Information Systems, Puerto Rico, August 13-15, 2015, Available at SSRN: https://ssrn.com/abstract=2769875\n* Ye, Y., “Open Source Software Sustainability Models: Initial White Paper from the Informatics Technology for Cancer Research Sustainability and Industry Partnership Work Group”, arXiv, 2019. https://arxiv.org/abs/1912.12371\n", "type": "Text_excerpt", "original_header": "Other resources", "parent_header": ["Table of Contents", "Trademark licensing &amp; franchising", "License and attribution"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}], "description": [{"result": {"value": "sustainability models for research software projects", "type": "String"}, "confidence": 1, "technique": "GitHub_API"}, {"result": {"value": "*A [foundation](https://en.wikipedia.org/wiki/Foundation_(nonprofit)) is a legal entity that can accept and/or disburse donations and be the legal owner of the Intellectual Property rights. Because their purpose is not to make a profit, they can be a great choice to signal neutrality and steward a project. In the US, foundations are either 501(c)(3) (nonprofit) or 501(c)(6) (trade consortium). Many software foundations are 501(c)(6) because 501(c)(3)s require demonstrating a charitable purpose, which can be more difficult in software.*\n\n*For a detailed discussion about this topic, see: Bavitz, Christopher; Topelson Ritvo, Dalia & Hessekiel, Kira. Organization & Structure of Open Source Software Development Initiatives: Challenges & Opportunities Concerning Corporate Formation, Nonprofit Status, & Governance for Open Source Projects (March 2017). Berkman Klein Center Research Publication. Available at: https://dash.harvard.edu/handle/1/30805146*\n\n#### Pros\n* Neutrality. Foundation protects the code and helps steward community\n  * Lowers barrier to sign Contributer License Agreements\n* Can encourage _Open Governance_ (you'll need to decide on foundation board, directors and rules)\n* Influence distributed across multiple donors\n* Can legitimize project, companies might feel more comfortable giving to foundations than individuals\n* Channel funds into a pot to then distribute back out to partners and third-parties\n* Foundation can apply indepentendly for research/government grants\n\n#### Cons\n* Bureaucracy and legal overhead (e.g. which country to start foundation in?)\n* Only really worth it for big projects (high upstart costs)\n* Difficult to set up for tax reasons (in US many do 501(c)(6) instead of 501(c)(3)), restrictions on what you can do\n  * The foundation might be restricted on how to spend donated funds\n* Requires serious community effort and diverse skills (you still need to fundraise after setting up the entity!)\n\n#### Case Studies\n* [Ruby Together](http://rubytogether.org/)\n* [Python Software Foundation](https://www.python.org/psf/)\n* [Node.js Foundation](https://www.sitepoint.com/goodbye-joyent-hello-node-js-foundation/)\n* [Apache Software Foundation](http://apache.org/foundation/)\n* [Open PHACTS Foundation](http://www.openphactsfoundation.org/)\n", "type": "Text_excerpt", "original_header": "Foundations &amp; consortiums", "parent_header": ["Table of Contents"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*Get people to volunteer their time to your project.*\n \n", "original_header": "Volunteers"}, "confidence": 0.8749044078211369, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*Stick a donation button on your project's site. Stripe and PayPal are examples of services a project can use to accept donations.* \n#### Cons\n* Usually not much money unless you have dedicated fundraising efforts\n* Need a legal entity to donate to (ex. [SFC](http://sfconservancy.org), [OpenCollective](http://opencollective.com), [NumFOCUS](http://www.numfocus.org) are fiscal sponsors for this purpose). Harder for individuals or international donations to manage\n* Sometimes not clear who “deserves” money in a project or to what efforts it gets distributed\n* Likelihood of success related to number of users, not importance of software \n", "original_header": "Donation button"}, "confidence": 0.8633898619540159, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*If you'd like to fund ongoing project work, you can set up a recurring crowdfunding campaign, with a monthly or annual financial commitment that renews indefinitely (or until the donor cancels). Those who use your project regularly (including both individuals and companies) might be willing to fund it.* \n", "original_header": "Crowdfunding (recurring)"}, "confidence": 0.9257862370649018, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*If your project is something people want to learn about, or it is in a domain that people want to learn about, your project could write and sell a book or series of books. You can find a publisher (like O'Reilly) or self-publish. In addition to selling books, some projects sell merchandise (ex. shirts, hoodies) to support their work.* \n#### Pros\n* Outcome not tied to project work itself, so you retain creative freedom\n* Can serve as marketing for the project itself\n* Can overlap other project documentation and training needs\n* Can be recurring source of revenue after initial development \n", "original_header": "Books &amp; merchandise"}, "confidence": 0.8743360508689023, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*If your project has a large audience, you can sell sponsorships to advertisers who might want to reach them. You probably have a very targeted audience (ex. if you have a Python project, you can assume your audience is likely people who are technically familiar with Python), so use that to your advantage.* \n", "original_header": "Advertising &amp; sponsorships"}, "confidence": 0.8327696197673463, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "#### Cons\n* Consulting requires human power, doesn’t scale well (except for rare outliers)\n* Business needs can distract from writing code or other tasks related to the project itself\n* Can be at odds with making software simple to use\n* Project needs to be sufficiently popular that people are willing to pay for related services \n", "original_header": "Consulting &amp; services"}, "confidence": 0.9176387058938286, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*Grants are effectively large donations that do not require repayment. Oftentimes the grantmaker receives other benefits from giving you the grant, such as access to your project's developers, demonstration of impact, a report of the project work, or tax benefits.* \n*Grants can come from many places, including companies, software foundations, philanthropic foundations, and the government. The technical and legal aspects of a grant vary greatly depending on where it comes from. For example, a company might give a project a \"grant\" but legally treat it as a consulting invoice. A philanthropic foundation can only make grants to nonprofits, so the project would need to be a nonprofit yourself, or (more commonly) find a nonprofit to sponsor it. If you're unfamiliar with grants, the best way to understand how grants work is to talk to someone who has received one before. Some examples of grant recipients are listed below.* \n", "original_header": "Grants"}, "confidence": 0.8993127038960594, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*SaaS means [Software as a Service](https://en.wikipedia.org/wiki/Software_as_a_service). In this model, the codebase itself is open source, but the project might offer additional paid services that make it easier for people to use the project. One common example of a paid service is charging for hosting.* \n", "original_header": "SaaS"}, "confidence": 0.9367156079369916, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "Software (and any SaaS provided) is open source and free to use, but an organization can pay (e.g., a larger fixed annual fee) to become an official _member_ or _supporter_ or _partner_ of the project. Membership give additional benefits such as having a stronger say in political or technical decisions, early access to development versions, larger usage quotas, custom integrations (e.g., single sign on), on-site training, and kudos by being officially listed.  Membership may also be available at various levels (e.g., bronze, silver, gold.) \n", "original_header": "Membership"}, "confidence": 0.9256581508833253, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*Under an [open core](https://en.wikipedia.org/wiki/Open_core) (or freemium) model, some aspects of the project are free, but other features are proprietary and available only to paid users. Usually this works when there is enterprise demand for the project.* \n#### Cons\n* Need to have something you can charge for (which means making certain features exclusive)\n* Can be at odds with making software freely accessible\n* “Two tiers” of product support can make free users unhappy \n", "original_header": "Open core"}, "confidence": 0.8833192050174042, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*Venture capital is a form of funding for high growth businesses. Unlike a bank loan or other forms of debt financing, venture capitaists take equity (a percent ownership in your business) in exchange for funding. The tradeoff is that unlike taking out a loan, you don't have to repay your creditors if your business tanks. If the project does succeed, however, it should expect to return capital to the investor at a multiple.* \n", "original_header": "Venture capital"}, "confidence": 0.8230261280492727, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "*If a FOSS project has a well-known name and large user community, it can potentially capitalize on its trademark as a form of intellectual property to license out to franchises that provide support or hardware appliances that use the software.* \n#### Cons\n* This is not a solution for software with small communities or a name\nthat is not well-known.\n* There has to be profitability in building appliances or franchises for\nsupport and training. This makes it a better fit for software that is\ncomplex to setup and maintain. \n", "original_header": "Trademark licensing &amp; franchising"}, "confidence": 0.9464330294213317, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}], "name": [{"result": {"value": "sustaining-research-projects", "type": "String"}, "confidence": 1, "technique": "GitHub_API"}], "full_name": [{"result": {"value": "danielskatz/sustaining-research-projects", "type": "String"}, "confidence": 1, "technique": "GitHub_API"}], "issue_tracker": [{"result": {"value": "https://api.github.com/repos/danielskatz/sustaining-research-projects/issues", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "forks_url": [{"result": {"value": "https://api.github.com/repos/danielskatz/sustaining-research-projects/forks", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "stargazers_count": [{"result": {"value": 91, "type": "Number"}, "confidence": 1, "technique": "GitHub_API"}], "forks_count": [{"result": {"value": 12, "type": "Number"}, "confidence": 1, "technique": "GitHub_API"}], "download_url": [{"result": {"value": "https://github.com/danielskatz/sustaining-research-projects/releases", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "readme_url": [{"result": {"value": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md", "type": "Url"}, "confidence": 1, "technique": "file_exploration"}], "type": [{"result": {"value": "non-software", "type": "String"}, "confidence": 1, "technique": "software_type_heuristics"}], "installation": [{"result": {"value": "*\"How can we find funding for our open source project?\"*\n\nFirst things first: This started as a fork from https://github.com/nayafia/lemonade-stand. [@nayafia](https://github.com/nayafia) wanted to focus on how people fund their work on open source projects, and not how the projects themselves are sustained, which she thought was out of scope for her document (see https://github.com/nayafia/lemonade-stand/issues/1), so I've created this instead.\n\nA project often starts with a bright idea and an initial commitment of volunteer time, or perhaps, a fixed term grant.  But what happens after that initial activity?  How can the project continue to sustain itself?  (We define sustainability as the capacity to endure.  Software is sustainable if it will continue to be available in the future, on new platforms, and meeting new needs.  [This is from slide 23 of http://www.slideshare.net/danielskatz/scientific-software-challenges-and-community-responses, though it may have been taken from somewhere else earlier - if you know where, please fix this.])\n\nThe intent below is to list how projects do this — support themselves over time.  Each funding category should ideally link to several real examples, and when possible, to a useful article or page instead of just a homepage.\n\nThe categories are not mutually exclusive. For example, a project might have a foundation but also use crowdfunding to raise money. Another project might provide services and also have a donation button. Etc. The purpose of this guide is to provide an exhaustive list of all the ways a project can survive, so that your project can figure out what works best for you.\n\n[probably drop this sentence later] In addition to suggesting ways that individual developers can get paid for their work, most of these categories are useful for projects that want to find funding for their project/team.\n\n\n---\n\n", "type": "Text_excerpt", "original_header": "A guide to sustainability models for research software projects."}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"value": "As with [the original](https://github.com/nayafia/lemonade-stand) from [@nayafia](https://github.com/nayafia), this guide welcomes changes and edits.  If something is factually incorrect (especially with a case study example), your edits would be great.  Also, if there's a category that's missing, please add it.\n", "type": "Text_excerpt", "original_header": "Contributing to this guide", "parent_header": ["Table of Contents", "Trademark licensing &amp; franchising"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}], "support": [{"result": {"value": "* [Linux Kernel](https://www.kernel.org)\n* [Mozilla Firefox](https://developer.mozilla.org/en-US/docs/MDN/Community)\n* [Apache Open Office](https://openoffice.apache.org/get-involved.html)\n* [yt](http://yt-project.org)\n", "type": "Text_excerpt", "original_header": "Case Studies", "parent_header": ["Table of Contents", "Trademark licensing &amp; franchising"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}, {"result": {"value": "*Companies sometimes support particular projects via paying for some development in that project, \nor by supporting a PhD or researcher to undertake a specific development project. \nFind a company that uses your project, and determine something the project wants to do that the company is willing to put work into.  \n(Note that this might overlap Consulting & services below.)*\n\n#### Pros\n* Taps into those who have resources (i.e. companies)\n* Can be well-aligned with company needs\n* In certain areas, industrial support for PhD or researcher positions is already an established mechanism\n\n#### Cons\n* Usually involves “getting lucky”: no clear, repeatable path to finding this arrangement\n* Project already needs to be well-known and used\n* Governance issues, company could have undue influence over project\n* Can affect project dynamics + balance\n\n#### Case Studies\n* [BoneJ](http://www.bbsrc.ac.uk/documents/1701-bone-biology-software-pdf/) - with [F + P Specialist Modelling Group](http://www.fosterandpartners.com/designservices/research/specialist-modelling-group/)\n", "type": "Text_excerpt", "original_header": "Industry support", "parent_header": ["Table of Contents"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}], "contributing_guidelines": [{"result": {"value": "As with [the original](https://github.com/nayafia/lemonade-stand) from [@nayafia](https://github.com/nayafia), this guide welcomes changes and edits.  If something is factually incorrect (especially with a case study example), your edits would be great.  Also, if there's a category that's missing, please add it.\n", "type": "Text_excerpt", "original_header": "Contributing to this guide", "parent_header": ["Table of Contents", "Trademark licensing &amp; franchising"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}], "application_domain": [{"result": {"type": "String", "value": "Semantic web"}, "confidence": 0.802082378481118, "technique": "supervised_classification"}], "full_title": [{"result": {"type": "String", "value": "A guide to sustainability models for research software projects."}, "confidence": 1, "technique": "regular_expression", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}], "related_papers": [{"result": {"type": "Url", "value": "https://arxiv.org/abs/1912.12371"}, "confidence": 1, "technique": "regular_expression", "source": "https://raw.githubusercontent.com/danielskatz/sustaining-research-projects/master/README.md"}]}