[
    {
        "title": "Workflow-centric research objects: First class citizens in scholarly discourse.",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "Abstract. A workflow-centric research object bundles a workflow, theprovenance of the results obtained by its enactment, other digital objectsthat are relevant for the experiment (papers, datasets, etc.), and anno-tations that semantically describe all these objects. In this paper, wepropose a model to specify workflow-centric research objects, and showhow the model can be grounded using semantic technologies and exist-ing vocabularies, in particular the Object Reuse and Exchange (ORE)model and the Annotation Ontology (AO). We describe the life-cycle of aresearch object, which resembles the life-cycle of a scientific experiment.1 IntroductionScientific workflows are used to describe series of structured activities and com-putations that arise in scientific problem-solving, providing scientists from vir-tually any discipline with a means to specify and enact their experiments [3].From a computational perspective, such experiments (workflows) can be definedas directed acyclic graphs where the nodes correspond to analysis operations,which can be supplied locally or by third party web services, and where theedges specify the flow of data between those operations.Besides being useful to describe and execute computations, workflows alsoallow encoding of scientific methods and know-how. Hence they are valuable ob-jects from a scholarly point of view, for several reasons: (i) to allow assessmentof the reproducability of results; (ii) to be reused by the same or by a differ-ent scientist; (iii) to be repurposed for other goals than those for which it wasoriginally built; (iv) to validate the method that led to a new scientific insight;(v) to serve as live-tutorials, exposing how to take advantage of existing datainfrastructure, etc. This follows a trend that can be observed in disciplines such2as Biology and Astronomy, with other types of objects, such as databases, in-creasingly becoming part of the research outcomes of an individual or a group,and hence also being shared, cited, reused, versioned, etc. [11]However, the use of workflow specifications on their own does not guaran-tee to support reusability, shareability, reproducibility, or better understandingof scientific methods. Workflow environment tools evolve across the years, orthey may even disappear. The services and tools used by the workflow maychange or evolve too. Finally, the data used by the workflow may be updatedor no longer available. To overcome these issues, additional information may beneeded. This includes annotations to describe the operations performed by theworkflow; annotations to provide details like authors, versions, citations, etc.;links to other resources, such as the provenance of the results obtained by ex-ecuting the workflow, datasets used as input, etc.. Such additional annotationsenable a comprehensive view of the experiment, and encourage inspection ofthe different elements of that experiment, providing the scientist with a pictureof the strengths and weaknesses of the digital experiment in relation to decay,adaptability, stability, etc.These richly annotation objects are what we call workflow-centric researchobjects. The notion of Research Object has been introduced in previous work[20, 19, 1] – here we focus on Research Objects that encapsulate scientific work-flows (hence workflow-centric). In particular, we build on earlier work on my-Experiment packs, which are bundles that contain elements such as workflows,documents and presentations [15]. Other related work is presented in Section2. In this paper we extend that work making the following contributions: we",
        "publication_date": "2012-05-28",
        "authors": "Khalid Belhajjame, Óscar Corcho, Daniel Garijo, Jun Zhao, Paolo Missier, David Newman, Raúl Palma, Sean Bechhofer, Esteban García-Cuesta, Asunción Gómez‐Pérez, Graham Klyne, Kevin Page, Marco Roos, José Enrique Ruiz, Stian Soiland‐Reyes, L. Verdes–Montenegro, David De Roure, Carole Goble",
        "file_name": "20250512000840.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/paper-01/PDFs/20250512000840.pdf",
        "pdf_link": "http://ceur-ws.org/Vol-903/paper-01.pdf"
    }
]