[
    {
        "title": "PSM-Flow: Probabilistic Subgraph Mining for Discovering Reusable Fragments in Workflows",
        "implementation_urls": [],
        "doi": "10.1109/wi.2018.00-93",
        "arxiv": null,
        "abstract": "Abstract—Scientific workflows define computational processesneeded for carrying out scientific experiments. Existing workflowrepositories contain hundreds of scientific workflows, wherescientists can find materials and knowledge to facilitate workflowdesign for running related experiments. Identifying reusablefragments in growing workflow repositories has become in-creasingly important. In this paper, we present PSM-Flow, aprobabilistic subgraph mining algorithm designed to discovercommonly occurring fragments in a workflow corpus using amodified version of the Latent Dirichlet Allocation algorithm. Theproposed model encodes the geodesic distance between workflowsteps into the model for implicitly modeling fragments. PSM-Flow captures variations of frequent fragments while maintainingits space complexity bounded polynomially, as it requires nocandidate generation. We applied PSM-Flow to three real-worldscientific workflow datasets containing more than 750 workflowsfor neuroimaging analysis. Our results show that PSM-Flowoutperforms three state of the art frequent subgraph miningtechniques. We also discuss other potential future improvementsof the proposed method.I. INTRODUCTIONScientific workflows describe computational experimentswhich typically involve computational steps, along with thedatasets used and generated by those steps. Scientific work-flows are created in workflow systems that manage theirexecution with the required computational resources [13]. Rep-resenting workflows explicitly improves the reproducibility ofscientific experiments [12].Scientific workflow repositories contain collections ofrecorded scientific workflows. [23] Users may explore andreuse workflows created by others to facilitate the developmentof their computational experiments. While one can directlyreuse an existing workflow, only a portion or fragment of aworkflow is often reused. In addition, identifying commonlyused fragments of workflows facilitates overviewing and ex-ploring the contents of a workflow repository. [11]In [10], the authors formulated reusable workflow fragmentidentification as a frequent subgraph mining problem and ap-plied frequent subgraph mining algorithms (FSM) to detect thesubgraphs with high support count (number of occurrences)as candidate fragments. However, frequent subgraph miningtechniques present several limitations. First, these techniquestypically involve a candidate fragment generation process anda subgraph isomorphism test. Both present a time complex-ity (combinatorial exploration of candidate fragments) and aspace complexity (a large number of candidate subgraphs aregenerated in memory) that are exponential in the worst case.Second, frequent fragments may appear in different workflowswith small variations (e.g., with changes in node labels, orwith an additional node). Conventional frequent subgraph",
        "publication_date": "2018-12-01",
        "authors": "Chin Wang Cheong, Daniel Garijo, Cheung Kwok Wai, Yolanda Gil",
        "file_name": "20250512002640.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/psmFlow/PDFs/20250512002640.pdf",
        "pdf_link": "https://dgarijo.com/papers/psmFlow.pdf"
    }
]