[
    {
        "title": "A provenance-aware Linked Data application for trip management and organization",
        "implementation_urls": [],
        "doi": "10.1145/2063518.2063554",
        "arxiv": null,
        "abstract": "ABSTRACTWe present El Viajero, an application1 for exploiting, man-aging and organizing Linked Data in the domain of newsand blogs about travelling. El Viajero makes use of severalheterogeneous datasets to help users to plan future trips,and relies on the Open Provenance Model2 for modeling theprovenance information of the resources.Categories and Subject DescriptorsE.2 [Data storage representations]: Linked Representa-tionsGeneral TermsDesign, ExperimentationKeywordsLinked Data, provenance, news, blog1. INTRODUCTIONNews content providers rarely include provenance infor-mation about the resources that they generate and pub-lish, as already pointed out the W3C Provenance Incuba-tor Group3 in the News Aggregator Scenario Gap Analy-sis4. This provenance information is critical to determinewhether a resource can be trusted or not, since it allowsknowing about the source, references and process followedto create the resource.This paper describes how we exploit the provenance in-formation of guides, images, videos, trips and posts in orderto help other users to reuse and explore existing contentsto plan their own trips around the world. The application1http://webenemasuno.linkeddata.es/browser_en.html2http://openprovenance.org/3http://www.w3.org/2005/Incubator/prov/wiki/Main_Page4http://www.w3.org/2005/Incubator/prov/wiki/Analysis_of_News_Aggregator_Scenario#Gap_AnalysisPermission to make digital or hard copies of all or part of this work forpersonal or classroom use is granted without fee provided that copies arenot made or distributed for profit or commercial advantage and that copiesbear this notice and the full citation on the first page. To copy otherwise, torepublish, to post on servers or to redistribute to lists, requires prior specificpermission and/or a fee.I-SEMANTICS Triplification Challenge 2011 Graz, AustriaCopyright 2010 ACM 978-1-4503-0014-8/10/09 ...$10.00.manages the data retrieval transparently to the users, andorganizes the results in a map through a graphical interface.It relies on a dataset that we5 have recently published asLinked Data, containing the provenance information of theeditorial resources belonging to El Viajero6(which is part ofthe spanish newspaper El Páıs7). The dataset aggregates",
        "publication_date": "2011-09-07",
        "authors": "Daniel Garijo, Boris Villazón-Terrazas, Óscar Corcho",
        "file_name": "20250512002627.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/triplification/PDFs/20250512002627.pdf",
        "pdf_link": "https://dgarijo.com/papers/triplification.pdf"
    }
]