[
    {
        "title": "An intelligent interface for integrating climate, hydrology, agriculture, and socioeconomic models",
        "implementation_urls": [],
        "doi": "10.1145/3308557.3308711",
        "arxiv": null,
        "abstract": "ABSTRACT Understanding the interactions between natural processes and human activities poses major challenges as it requires the integration of models and data across disparate disciplines.  It typically takes many months and even years to create valid end-to-end simulations as different models need to be configured in consistent ways and generate data that is usable by other models. MINT is a novel framework for model integration that captures extensive knowledge about models and data and aims to automatically compose them together. MINT guides a user to pose a well-formed modeling question, select and configure appropriate models, find and prepare appropriate datasets, compose data and models into end-to-end workflows, run the simulations, and visualize the results. MINT currently includes hydrology, agriculture, and socioeconomic models.  Author Keywords Intelligent workflow systems; model integration; environmental modeling; scientific discovery.  CCS CONCEPTS H.5.m. Information interfaces and presentation (e.g., HCI): Miscellaneous. ACM Reference format: Daniel Garijo, Deborah Khider, Varun Ratnakar, Yolanda Gil, Kelly Cobourn, Ewa Deelman, Chris Duffy, Rafael Ferreira da Silva, Armen Kemanian, Craig Knoblock, Vipin Kumar, Sco Peckham, Yao-Yi Chiang, Ankush Khandelwal, Minh Pham, Jay Pujara, Maria Stoica, Kshitij Tayal, Binh Vu, Dan Feldman, Lele Shu, Rajiv Mayani, Anna Dabrowski, Daniel Hardesty-Lewis, Suzanne Pierce. 2018. An Intelligent Interface for Integrating Climate, Hydrology, Agriculture, and Socioeconomic Models. In Proceedings of IUI '19 Companion, March 17–20, 2019, Marina del Ray, CA, USA  hps://doi.org/10.1145/3308557.3308711 1 Introduction Understanding how human activities affect natural resources, and how natural processes affect societies requires complex computational simulations that cut across disciplinary boundaries. For example, in order to understand how weather predictions and agriculture practices affect water availability or how flooding affects planting strategies and population migration, modelers integrate physics-based climate and hydrology models with biologically-informed agriculture models and market distribution economic models. While the questions are short fused in order to prepare for natural disasters or to make near-term policy decisions, integrating these diverse models may take many months or even years.  Major challenges include finding relevant models to address a question and datasets with the necessary granularity and quality to run the models, developing sophisticated data transformations to set up and execute a model, and checking for models compatibility. Existing infrastructure supports some aspects of the modeling ",
        "publication_date": "2019-02-28",
        "authors": "Daniel Garijo, Deborah Khider, Varun Ratnakar, Yolanda Gil, Ewa Deelman, Rafael Ferreira da Silva, Craig A. Knoblock, Yao‐Yi Chiang, Tam Minh Pham, Jay Pujara, Bình Dương Vũ, Dan Feldman, Rajiv Mayani, Kelly M. Cobourn, Christopher Duffy, Armen R. Kemanian, Lele Shu, Vipin Kumar, Ankush Khandelwal, Kshitij Tayal, S. D. Peckham, Maria Stoica, Anna Dabrowski, Daniel Hardesty-Lewis, Suzanne A. Pierce",
        "file_name": "20250512002653.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/iuiDemo2019/PDFs/20250512002653.pdf",
        "pdf_link": "https://dgarijo.com/papers/iuiDemo2019.pdf"
    }
]