[
    {
        "arxiv": null,
        "authors": "Katrina L. Grasby, Neda Jahanshad, Jodie N. Painter, Lucía Colodro‐Conde, Janita Bralten, Derrek P. Hibar, Penelope A. Lind, Fabrizio Pizzagalli, Christopher R. K. Ching, Mary McMahon, Natalia Shatokhina, Leo Zsembik, Sophia I. Thomopoulos, Alyssa H. Zhu, Lachlan T. Strike, Ingrid Agartz, Saud Alhusaini, Marcio Almeida, Dag Alnæs, Inge K. Amlien, Micael Andersson, Tyler Ard, Nicola J. Armstrong, Allison E. Ashley‐Koch, Joshua Atkins, Manon Bernard, Rachel M. Brouwer, Elizabeth E.L. Buimer, Robin Bülow, Christian Bürger, Dara M. Cannon, M. Mallar Chakravarty, Qiang Chen, J. Cheung, Baptiste Couvy‐Duchesne, Anders M. Dale, Shareefa Dalvie, Tânia Kawasaki de Araujo, Greig I. de Zubicaray, Sonja M. C. de Zwarte, Anouk den Braber, Nhat Trung Doan, Katharina Dohm, Stefan Ehrlich, Hannah-Ruth Engelbrecht, Susanne Erk, Chun Fan, Iryna O. Fedko, Sonya Foley, Judith M. Ford, Masaki Fukunaga, Melanie E. Garrett﻿, Tian Ge, Sudheer Giddaluru, Aaron L. Goldman, Melissa J. Green, Nynke A. Groenewold, Dominik Grotegerd, Tiril P. Gurholt, Boris A. Gutman, Narelle K. Hansell, Mathew A. Harris, Marc Harrison, Courtney C. Haswell, Michael A. Hauser, Stefan Herms, Dirk J. Heslenfeld, New Fei Ho, David Hoehn, Per Hoffmann, Laurena Holleran, Martine Hoogman, Jouke‐Jan Hottenga, Masashi Ikeda, Deborah Janowitz, Iris E. Jansen, Tianye Jia, Christiane Jockwitz, Ryota Kanai, Sherif Karama, Dalia Kasperavičiūtė, Tobias Kaufmann, Sinéad Kelly, Masataka Kikuchi, Marieke Klein, Michael Knapp, Annchen R. Knodt, Bernd Krämer, Max Lam, T. Lancaster, Phil H. Lee, Tristram A. Lett, Lindsay B. Lewis, Íscia Lopes‐Cendes, Michelle Luciano, Fabìo Macciardi, André F. Marquand, Samuel R. Mathias, Tracy R. Melzer, Yuri Milaneschi",
        "doi": "10.1126/science.aay6690",
        "file_name": "20250512003137.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/genetic_architecture_of_the_human_cerebral_cor/PDFs/20250512003137.pdf",
        "pdf_link": "https://dgarijo.com/papers/genetic_architecture_of_the_human_cerebral_cor.pdf",
        "publication_date": "2020-03-19",
        "title": "The genetic architecture of the human cerebral cortex"
    }
]