[
    {
        "title": "OntoSoft: An Ontology for Capturing Scientific Software Metadata",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "ABSTRACT This paper presents OntoSoft, an ontology to describe metadata for scientific software. The ontology is designed considering how scientists would approach the reuse and sharing of software.  This includes supporting a scientist to: 1) identify software, 2) understand and assess software, 3) execute software, 4) get support for the software, 5) do research with the software, and 6) update the software.  The ontology is available in OWL and contains more than fifty terms. We are using OntoSoft to structure a software registry for geosciences, and to develop user interfaces to capture its metadata. Author Keywords Ontologies, software reuse, knowledge capture. ACM Classification Keywords H.5.2 [Information Interfaces and Presentation]: User Interfaces - Interaction styles.  INTRODUCTION Scientific software captures important knowledge and should be shared and reused.  Although there are many popular code repositories used by scientists there is still a significant amount of software that is never shared.  The reasons for not sharing scientific software include the desire to not expose less-than-ideal code, lack of incentives and credit for software, and interest in software commercialization among others [Howison and Herbsleb 2011].  While the loss of “dark data” in science is well recognized [Heidorn 2008], there is an analogous problem in the pervasive loss of “dark software”. Our interest is in supporting software sharing across the geosciences. With the exception of big model packages typically shared in modeling frameworks, geosciences software is rarely shared.  In addition, it is scattered in different sites and not easy to find or reuse. Our goal is to improve software sharing by developing a software registry framework that includes metadata useful for discovery and reuse among scientists who are not software developers.   This paper introduces the OntoSoft software registry and its ontology for describing scientific software metadata. The ontology contains basic metadata properties to describe how to identify software, understand what it does and its utility for research, execute it, get support if questions arise, do research with it, and contribute to its development.  These are all topics of interest to scientists, and the ontology revolves around those categories as a way to frame the requests for metadata in a practical light to incentivize scientists to provide it.   RELATED WORK The Core Software Ontology (CSO) and the Core Ontology of Software Components (COSC) and [Oberle et al 2006] ",
        "publication_date": "2015-12-01",
        "authors": "Youn-Hee Gil",
        "file_name": "20250512001328.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/gil-etal-kcap2015/PDFs/20250512001328.pdf",
        "pdf_link": "https://dgarijo.com/papers/gil-etal-kcap2015.pdf"
    }
]