[
    {
        "title": "Morph-KGC star : Declarative generation of",
        "implementation_urls": [
            {
                "identifier": "https://github.com/oeg-upm/morph-kgc",
                "type": "git",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://github.com/oeg-upm/Widoco",
                "type": "git",
                "paper_frequency": 1,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": null,
        "arxiv": null,
        "abstract": "Abstract. RDF-star has been proposed as an extension of RDF to annotate statements with triples. Libraries and graph storeshave started adopting RDF-star, but the generation of RDF-star data remains largely unexplored. To allow generating RDF-starfrom heterogeneous data, RML-star was proposed as an extension of RML. However, no implementation has been developedso far that implements the RML-star specification. In this work, we present Morph-KGCstar, which extends the Morph-KGCmaterialization engine to generate RDF-star datasets. We validate Morph-KGCstar by running test cases derived from the N-Triples-star syntax tests and we apply it to two real-world use cases from the biomedical and open science domains. We comparethe performance of our approach against other RDF-star generation methods (SPARQL-Anything), showing that Morph-KGCstarscales better for large input datasets, but it is slower when processing multiple smaller files.Keywords: Knowledge Graphs, RDF-star, RML-star, Data Integration1. IntroductionRDF-star [1] was proposed as an extension of RDF [2] to annotate statements and, thus, make statements aboutother statements (also known as reification [3]). RDF-star extends the RDF’s conceptual data model and concretesyntaxes by providing a compact alternative to other reification approaches, such as standard reification [4] orsingleton properties [5]. Following the uptake of the initial version of RDF-star, the W3C RDF-DEV CommunityGroup1 recently released a W3C Final Community Group Report [6] and the RDF-star Working Group2 has recentlybeen formed to extend related W3C Recommendations.Even though several libraries and graph stores have already adopted RDF-star3, the generation of RDF-star graphsremains largely unexplored. RDF graphs are often generated from heterogeneous semi-structured data, e.g., data inCSV, XML or JSON formats, etc. To generate RDF graphs, mapping languages are used to specify how RDF termsand triples can be generated from these data. The syntax of these mapping languages are either custom or repurposed.*Corresponding author. E-mail: julian.arenas.guerrero@upm.es.**The authors contributed equally to this work.1https://www.w3.org/groups/cg/rdf-dev2https://www.w3.org/groups/wg/rdf-star3https://w3c.github.io/rdf-star/implementations1570-0844/$35.00 © 0 – IOS Press and the authors. All rights reservedmailto:julian.arenas.guerrero@upm.esmailto:ana.iglesiasm@upm.esmailto:daniel.garijo@upm.esmailto:oscar.corcho@upm.esmailto:david.chaves@kuleuven.bemailto:anastasia.dimou@kuleuven.bemailto:julian.arenas.guerrero@upm.eshttps://www.w3.org/groups/cg/rdf-devhttps://www.w3.org/groups/wg/rdf-starhttps://w3c.github.io/rdf-star/implementations2 J. Arenas-Guerrero et al. / Declarative generation of RDF-star graphs from heterogeneous data1 12 23 34 45 56 67 78 89 910 1011 1112 1213 13",
        "publication_date": null,
        "authors": "",
        "file_name": "20250511234452.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/swj_arenas_2024/PDFs/20250511234452.pdf",
        "pdf_link": "https://dgarijo.com/papers/swj_arenas_2024.pdf"
    }
]