[
    {
        "title": "OntoSoft: A distributed semantic registry for scientific software",
        "implementation_urls": [],
        "doi": "10.1109/escience.2016.7870916",
        "arxiv": null,
        "abstract": "Abstract— OntoSoft is a distributed semantic registry for scientific software. This paper describes three major novel contributions of OntoSoft: 1) a software metadata registry designed for scientists, 2) a distributed approach to software registries that targets communities of interest, and 3) metadata crowdsourcing through access control. Software metadata is organized using the OntoSoft ontology along six dimensions that matter to scientists: identify software, understand and assess software, execute software, get support for the software, do research with the software, and update the software. OntoSoft is a distributed registry where each site is owned and maintained by a community of interest, with a distributed semantic query capability that allows users to search across all sites. The registry has metadata crowdsourcing capabilities, supported through access control so that software authors can allow others to expand on specific metadata properties.  Keywords—software registries, software metadata, scientific software, software catalogs, software repositories I. INTRODUCTION The software developed by scientists embodies important scientific knowledge that should be explicitly captured, curated, managed, and disseminated. Software captures mathematical models, statistical analyses, and causal reasoning that are used to generate new results. Scientists recognize the value of sharing software to avoid replicating effort and to inspect and reproduce results from others. In addition, recurring issues of provenance and uncertainty in the context of data could be better addressed with improved treatment of software: one of the best ways to understand data is to look at the software that uses it or generates it.  A major issue for scientific software reuse is the dissemination and documentation of existing codes. Although code repositories already exist and are used by many scientists, they typically contain basic metadata such as authors, license but lack appropriate metadata to facilitate discovery and reuse.  A second major issue in scientific software sharing is the limited sharing of codes used in scientific publications. While the loss of “dark data” in science is well recognized [1], we see an analogous problem in the pervasive loss of “dark software”. Many scientists do not share their software, because they are unaware of its value, or they do not know how, or they are worried about not getting proper acknowledgment, or they do not see its value. Studies show that scientists spend between 60% to 80% of a project’s effort collecting and preparing data before doing new science (e.g., [2]). This would indicate a significant overhead in developing software for data preparation that is only rarely shared and rarely reused. A common concern is the relatively lower quality of such software, since it is typically not written with robustness or generality in mind and scientists do not want their reputations ",
        "publication_date": "2016-10-01",
        "authors": "Yolanda Gil, Daniel Garijo, Saurabh Mishra, Varun Ratnakar",
        "file_name": "20250512001441.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/ontoSoft2016/PDFs/20250512001441.pdf",
        "pdf_link": "https://dgarijo.com/papers/ontoSoft2016.pdf"
    }
]