[
    {
        "title": "An ontology for videogame interoperability",
        "implementation_urls": [],
        "doi": "10.1007/s11042-016-3552-6",
        "arxiv": null,
        "abstract": "Abstract During the last 20 years, video games have become very popular and widelyadopted in our society. However, despite the growth on video game industry, there is a lackof interoperability that allow developers to interchange their information freely and to formstronger partnerships. In this paper we present the Video Game Ontology (VGO), a model forenabling interoperability among video games and enhancing data analysis of gameplayinformation. We describe the creation process of the ontology, the ontology conceptualizationand its evaluation. In addition, we demonstrate the applicability of the Video Game Ontologyin action with three example games that take advantage of the created ontology. Also, wedemonstrate the use of the VGO in enabling interoperability among the example games.Keywords Video game ontology. Video game interoperability . Ontology evaluation1 IntroductionDuring the last decade, the video game industry has changed greatly due to growth of mobilegames and digital distribution channels [12], such as Steam1 and Google Play Store.2 Withintroduction of casual games like Angry Birds3 and Candy Crush Saga4 the video gameindustry has gained a significant growth boost even further [6]. Playing video games hasMultimed Tools ApplDOI 10.1007/s11042-016-3552-61http://store.steampowered.com/2https://play.google.com3https://www.angrybirds.com/4http://candycrushsaga.com/* Janne Parkkilajanne.parkkila@lut.fi1 School of Business and Management, Innovation and Software, Lappeenranta University ofTechnology, Lappeenranta, Finland2 Ontology Engineering Group Madrid, Universidad Politecnica de Madrid, Madrid, Spainhttp://crossmark.crossref.org/dialog/?doi=10.1007/s11042-016-3552-6&domain=pdfhttp://dx.doi.org/http://store.steampowered.com/http://dx.doi.org/http://store.steampowered.com/http://dx.doi.org/http://store.steampowered.com/http://dx.doi.org/http://store.steampowered.com/become an accepted form of entertainment and video games are played among all ages andtypes of people [4]. It is estimated that the total video game market will grow to be over 100billion US dollars by 2018 [8].This growth has also lead to a fierce competition between game companies, leading intoproblems such as visibility of new games in digital marketplaces [11] and grown budgetrequirements for marketing. Similar problems are familiar in other business fields and mar-keting professionals have recognized co-branding [1, 17] and cross-promotion [5, 14] aspossible solutions to address these issues. In co-branding, the goal is to form a partnershipbetween two or more companies and to market products together. In cross- promotion, closelyrelated products are marketed together, such as teleoperators offering their customers discountsfor music streaming services. Taking into account the perspective of co-operation among thegame developers, the possibility of connecting games together may enable new benefits for thegame companies [2], such as improving player engagement and boosting player discovery ofnew games based on their previously played games. However, this requires technologicalsolutions to enable interoperability among separate video game products. To this date,exchanging information between video games has been achieved in an ad-hoc manner amongsingle products, but there are no general solutions for interoperability between video games.Exchanging game-related information between two games may enable players to usecommon items that can be carried over from one game to another. In addition, completing",
        "publication_date": "2016-05-17",
        "authors": "Janne Parkkila, Filip Radulović, Daniel Garijo, María Poveda‐Villalón, Jouni Ikonen, Jari Porras, Asunción Gómez‐Pérez",
        "file_name": "20250512001414.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/vgo/PDFs/20250512001414.pdf",
        "pdf_link": "https://dgarijo.com/papers/vgo.pdf"
    }
]