[
    {
        "title": "MINT: Model INTegration Through Knowledge-Powered Data and Process Composition",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "Abstract: Major societal and environmental challenges require forecasting how natural processes and human activities affect one another. Model integration across natural and social science disciplines to study these problems requires resolving semantic, spatio-temporal, and execution mismatches, which are largely done by hand today and may take more than two years of human effort.  We are developing the Model INTegration (MINT) framework that incorporates extensive knowledge about models and data, with several innovative components: 1) New principle-based ontology generation tools for modeling variables, used to describe models and data; 2) A novel workflow system that selects relevant models from a curated registry and uses abductive reasoning to hypothesize new models and data transformation steps; 3) A new data discovery and integration framework that finds and categorizes new sources of data, learns to extract information from both online sources and remote sensing data, and transforms the data into the format required by the models; 4) New knowledge-guided machine learning algorithms for model parameterization to improve accuracy and estimate uncertainty; 5) A novel framework for multi-modal scalable workflow execution.  We are beginning to annotate models and datasets using standard ontologies, and to compose and execute workflows of models that span climate, hydrology, agriculture, and economics. We are building on many previously existing tools, including CSDMS, BMI, GSN, WINGS, Pegasus, Karma, and GOPHER.  Rapid model integration would enable efficient and comprehensive coupled human and natural system modeling.  Keywords: Model integration, semantic workflows, ontologies, reasoning, automated planning, machine learning, model metadata, data catalogs, model catalogs.     1 INTRODUCTION  Major societal and environmental challenges require forecasting how natural processes and human activities affect one another. This requires integrating highly heterogeneous models from separate disciplines, including geosciences, agriculture, economics, and social sciences. Model integration requires resolving semantic, spatio-temporal, and execution mismatches, which are largely done by hand today. It is also challenging to locate appropriate models and to find data at the resolution needed for each scenario and region. In addition, models are often designed or calibrated to approximate the real phenomena under study, which can lead to poor performance. Composing models to enable end-to-end simulations and executing them with large-scale data requires coordinating many requirements. Y. Gil et al. / MINT: Model Integration Through Knowledge-Rich Data and Process Composition  Unfortunately, model integration is extremely time consuming and integrating two or three models from different disciplines can take months or years. There are tools such as repositories to find models (Peckham et al 2013), software for regridding data to address mismatches of time and space scales, data representation standards, and model coupling for execution interleaving (BMI 2018).  However, these tools address only slices of the process and are not well integrated, so model integration is largely done by hand. (Laniak et al 2013) call for the “development of standards for publishing data and models in forms suitable for automated discovery, access, and integration.”  The paper describes initial work to develop an end-to-end approach that uses artificial intelligence to assist modelers by automating and improving important aspects of model integration. Building on our extensive prior work in artificial intelligence and modeling, we are developing the MINT (Model INTegration) framework that incorporates three key innovations: 1) Semantic technologies to address model and data discovery and to bridge the heterogeneity of model requirements and assumptions; 2) Automated planning to resolve data mismatches by including data transformations; and 3) Machine learning to improve model parameterization through the extraction of more accurate data from remote sensing and other sources and search optimization.  ",
        "publication_date": "2018-01-01",
        "authors": "Yolanda Gil, Kelly M. Cobourn, Ewa Deelman, Christopher Duffy, Rafael Ferreira da Silva, Armen R. Kemanian, Craig A. Knoblock, Vipin Kumar, S. D. Peckham, Lucas Carvalho, Yao-Yi Chang, Daniel Garijo, Ankush Khandelwal, Deborah Khider, Minh Pahm, Jay Pujara, Varun Ratnakar, Maria Stoica, Bình Dương Vũ",
        "file_name": "20250512000646.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/iemss2018-MINT/PDFs/20250512000646.pdf",
        "pdf_link": "https://dgarijo.com/papers/iemss2018-MINT.pdf"
    }
]