[
    {
        "title": "P4ML: A Phased Performance-Based Pipeline Planner for Automated Machine Learning",
        "implementation_urls": [
            {
                "identifier": "https://github.com/usc-isi-i2/dsbox-ta2",
                "type": "git",
                "paper_frequency": 4,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://github.com/automl/auto-sklearn",
                "type": "git",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://doi.org/10.5281/zenodo.1251320",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://doi.org/10.5281/zenodo.1251317",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": null,
        "arxiv": null,
        "abstract": "AbstractWhile many problems could benefit from recent advances in machine learning, significanttime and expertise are required to design customized solutions to each problem. Priorattempts to automate machine learning have focused on generating multi-step solutionscomposed of primitive steps for feature engineering and modeling, but using already cleanand featurized data and carefully curated primitives. However, cleaning and featurizationare often the most time-consuming steps in a data science pipeline. We present a novelapproach that works with naturally occurring data of any size and type, and with diversethird-party data processing and modeling primitives that can lead to better quality so-lutions. The key idea is to generate multi-step pipelines (or workflows) by factoring thesearch for solutions into phases that apply a different expert-like strategy designed to im-prove performance. This approach is implemented in the P4ML system, and demonstratessuperior performance over other systems on a variety of raw datasets.Keywords: Automating machine learning, planning, pipelines, workflows, AutoML1. IntroductionMachine learning applications require significant expertise, tuning and effort. Research onautomating machine learning (AutoML) focuses on developing approaches to automaticallygenerate models for a given dataset, including any necessary featurization and data prepa-ration steps. Early work in this area explored the use of artificial intelligence planning togenerate multi-step pipelines (i.e., workflows) composed of data pre-processing and modelingsteps (St. Amant and Cohen, 1998; Hauder et al., 2011). Given the ubiquity of data and thegreat interest in exploiting it, AutoML has been receiving increased attention. Auto-sklearnuses Bayesian optimization methods, and placed first in the ChaLearn AutoML challenge(Feurer et al., 2015a). Fusi et al. (2017) augmented that approach with probabilistic ma-trix factorization. A very different approach was used in TPOT, which relies on geneticalgorithms to explore combinations of steps that lead to better performance (Olson et al.,2016b). However, there are still many open research topics in AutoML. Existing approachesfocus on feature engineering and modeling, and assume that the data is already clean andthat numerical features have already been generated. They use a carefully selected andwell-curated set of pre-processing and modeling steps (or primitives) in order to make thesearch manageable. They also focus on classification tasks. Our goal is to design AutoMLapproaches that can accommodate any type of naturally occurring data, any collection ofc© 2018 Y. Gil et al.P4ML: A Phased Performance-Based Pipeline Planner for Automated Machine Learningprimitives, and any size of data. This paper presents a novel approach to AutoML thatsupports these goals and that has three key contributions:1. Exploits expert strategies to structure the search for solutions in a machine learningproblem into meaningful phases,2. Uses knowledge about both datasets and primitives in order to design end-to-endpipelines that include data cleaning and featurization steps,3. Explores the search space efficiently and returns the best solution found within a giventime limit.The paper begins articulating our goals and requirements, followed by an overview of ourapproach. We then describe the implementation of our approach in P4ML, a phasedperformance-based pipeline planner for automating machine learning. P4ML was popu-lated with dozens of diverse third-party primitives, and the evaluations so far demonstratesuperior performance on a variety of naturally occurring datasets.2. Goals and RequirementsOur goal is to automate machine learning with approaches that will handle naturally oc-curring datasets, which leads us to several important requirements not addressed in prior",
        "publication_date": null,
        "authors": "",
        "file_name": "20250512000715.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/AutoML2018/PDFs/20250512000715.pdf",
        "pdf_link": "https://dgarijo.com/papers/AutoML2018.pdf"
    }
]