[
    {
        "title": "The DISK Hypothesis Ontology: Capturing Hypothesis Evolution for Automated Discovery.",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "ABSTRACT Automated discovery systems can formulate and revise hypotheses by gathering and analyzing data. In order to generate new hypotheses and provide explanations of their new findings, these systems need a language to represent hypotheses, their revisions, and their provenance. This paper describes the DISK hypothesis ontology which fulfills these requirements.  The paper then presents a survey of existing models for representing hypotheses along with their features and tradeoffs. We compare these hypothesis models in the context of automated discovery and hypothesis evolution.  CCS CONCEPTS • Information systems → Artificial intelligence; Knowledge representation and reasoning KEYWORDS Hypothesis representation, hypothesis evolution, nanopublications, micropublications, automated discovery, ontologies. 1 INTRODUCTION Formal representations of scientific hypotheses would be useful in many contexts. For instance, in order to keep up with the latest updates on a research area, scientists need to quickly understand the contributions of an article and how it was derived from others. However, the vast amount of new scientific publications makes this task increasingly complex. If scientists represented hypotheses formally in publications, related literature could be easily searched for hypotheses of interest. Alternatively, machine reading systems could also extract hypotheses from text in articles, and generate these formal representations.  Formal representations of hypotheses may also be used to improve reproducibility. Community initiatives on reproducibility promote registering hypotheses and methods before conducting the research [Munafo et al 2017]. Hypotheses are stated in textual form, which can express arbitrarily complex statements about hypotheses. However, text can be imprecise and ambiguous. Creating machine readable representations of research hypotheses would facilitate the organization and management of the literature. To date there is not a standard way of capturing the contents and context of a hypothesis to understand its evolution.  Another important use of formal hypothesis representations is to enable automated discovery systems to do hypothesis testing and revision. Autonomous discovery systems generate hypotheses autonomously based on analysis of relevant data [Pankratius et al 2016; King 2017; Gil et al 2017].  In this paper, we focus on hypothesis representations to capture hypothesis evolution in automated discovery systems. We discuss the requirements that we have found throughout work on the DISK discovery system [Gil et al 2017]. We propose an ontology for hypothesis representation, and compare it to existing models for representing hypotheses.  ",
        "publication_date": "2017-01-01",
        "authors": "Daniel Garijo, Yolanda Gil, Varun Ratnakar",
        "file_name": "20250512000729.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/garijo_sciknow17/PDFs/20250512000729.pdf",
        "pdf_link": "https://dgarijo.com/papers/garijo_sciknow17.pdf"
    }
]