{"somef_provenance": {"somef_version": "0.9.9", "somef_schema_version": "1.0.0", "date": "2025-05-12 00:23:15"}, "code_repository": [{"result": {"value": "https://github.com/fhircat/CORD-19-on-FHIR", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "owner": [{"result": {"value": "fhircat", "type": "Organization"}, "confidence": 1, "technique": "GitHub_API"}], "date_created": [{"result": {"value": "2020-03-17T21:46:57Z", "type": "Date"}, "confidence": 1, "technique": "GitHub_API"}], "date_updated": [{"result": {"value": "2025-01-13T04:14:35Z", "type": "Date"}, "confidence": 1, "technique": "GitHub_API"}], "description": [{"result": {"value": "Semantics for COVID-19 Discovery", "type": "String"}, "confidence": 1, "technique": "GitHub_API"}, {"result": {"type": "Text_excerpt", "value": "CORD-19-on-FHIR is a Linked Data version of the \nCOVID-19 Open Research Dataset [(CORD-19)](https://pages.semanticscholar.org/coronavirus-research) data, provided by the [Allen Institute](https://alleninstitute.org/) to support research on COVID-19 / SARS-CoV-2 / Novel Coronavirus.  It is represented \nin [FHIR RDF](https://www.hl7.org/fhir/rdf.html)\nand was produced by data mining the CORD-19 dataset and adding semantic annotations.  The purpose is to facilitate linkage with other biomedical datasets and enable answering research questions.  \n", "original_header": "CORD-19-on-FHIR -- Semantics for COVID-19 Discovery"}, "confidence": 0.9428307510343746, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "We plan to parse the full text articles soon, for those that we can access.   \n", "original_header": "Semantic annotations"}, "confidence": 0.917216710935345, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "We have produced a linked version of the dataset. See an **RDF turtle** example [here](https://github.com/fhircat/CORD-19-on-FHIR/blob/master/examples/PMC212558_t.ttl). A number of **sparql queries** to identify the instances of different data types are aviable at [here](https://github.com/fhircat/CORD-19-on-FHIR/wiki/PubTator-Dataset). \n", "original_header": "CORD-19 Dataset"}, "confidence": 0.8330629041704323, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "[LitCovid](https://www.ncbi.nlm.nih.gov/research/coronavirus/) is a curated literature hub for tracking up-to-date scientific information about the 2019 novel Coronavirus. It is the most comprehensive resource on the subject, providing a central access to 3207 (and growing) relevant articles in PubMed. We have produced a linked version of the dataset. A number of **sparql queries** to identify the instances of different data types are aviable at [here](https://github.com/fhircat/CORD-19-on-FHIR/wiki/LitCovid-Dataset). \n", "original_header": "LitCovid Dataset"}, "confidence": 0.9919958356009704, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "We are developing the COVID-19 PICO Ontology (CPICO) that is an extension of Cochrane PICO Ontology for supporting COVID-19 evidence extraction and formulating COVID-19 research questions. The CPICO Ontology defines specific subtypes for the PICO classes of Population, Intervention, and Outcome. See details [here](https://github.com/fhircat/CORD-19-on-FHIR/tree/master/ontologies).\n \n", "original_header": "Ontologies"}, "confidence": 0.926848111820116, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}, {"result": {"type": "Text_excerpt", "value": "-**Pipfile, Pipfile.lock** -- Use by pip python installer\n- **contexts** -- JSON-LD 1.1 `@context` files used in converting JSON data files into RDF Turtle\n- **source** -- Source data from CORD-19 release, EXCEPT for the commercial subset, which was too big to put on github.  It is available here: https://ai2-semanticscholar-cord-19.s3-us-west-2.amazonaws.com/2020-03-13/comm_use_subset.tar.gz\n- **datasets** -- CORD-19-on-FHIR releases.  There is one zip for corresponding to each of the CORD-19 source subsets.  And there are zip files that, taken together, correspond to the CORD-19 metadata file. Pubtator annotatio release is under the folder Pubtator_RDF.\n- **examples** -- A few sample files, illustrating the content of the `datasets` directory. \n", "original_header": "Files"}, "confidence": 0.8642310218972522, "technique": "supervised_classification", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}], "name": [{"result": {"value": "CORD-19-on-FHIR", "type": "String"}, "confidence": 1, "technique": "GitHub_API"}], "full_name": [{"result": {"value": "fhircat/CORD-19-on-FHIR", "type": "String"}, "confidence": 1, "technique": "GitHub_API"}], "issue_tracker": [{"result": {"value": "https://api.github.com/repos/fhircat/CORD-19-on-FHIR/issues", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "forks_url": [{"result": {"value": "https://api.github.com/repos/fhircat/CORD-19-on-FHIR/forks", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "stargazers_count": [{"result": {"value": 41, "type": "Number"}, "confidence": 1, "technique": "GitHub_API"}], "forks_count": [{"result": {"value": 8, "type": "Number"}, "confidence": 1, "technique": "GitHub_API"}], "download_url": [{"result": {"value": "https://github.com/fhircat/CORD-19-on-FHIR/releases", "type": "Url"}, "confidence": 1, "technique": "GitHub_API"}], "programming_languages": [{"result": {"value": "Python", "name": "Python", "type": "Programming_language", "size": 12304}, "confidence": 1, "technique": "GitHub_API"}, {"result": {"value": "Shell", "name": "Shell", "type": "Programming_language", "size": 637}, "confidence": 1, "technique": "GitHub_API"}], "releases": [{"result": {"type": "Release", "value": "https://api.github.com/repos/fhircat/CORD-19-on-FHIR/releases/25634963", "tag": "2020-4-17", "name": "LitCovid", "author": {"name": "dnstone", "type": "User"}, "description": "LitCovid RDF TTL files", "tarball_url": "https://api.github.com/repos/fhircat/CORD-19-on-FHIR/tarball/2020-4-17", "zipball_url": "https://api.github.com/repos/fhircat/CORD-19-on-FHIR/zipball/2020-4-17", "html_url": "https://github.com/fhircat/CORD-19-on-FHIR/releases/tag/2020-4-17", "url": "https://api.github.com/repos/fhircat/CORD-19-on-FHIR/releases/25634963", "release_id": 25634963, "date_created": "2020-04-16T21:22:50Z", "date_published": "2020-04-18T04:34:57Z"}, "confidence": 1, "technique": "GitHub_API"}], "license": [{"result": {"value": "CORD-19-on-FHIR LICENSE\n\nCORD-19-on-FHIR is a data mining dataset derived from the CORD-19\ndataset released by the Allen Institute (AI2), described at\nhttps://pages.semanticscholar.org/coronavirus-research .  As such,\nthe CORD-19-on-FHIR dataset is a \"derivative work\", produced under the\nCORD-19 license terms.  The results of the CORD-19-on-FHIR data mining\nare represented in FHIR RDF https://www.hl7.org/fhir/rdf.html in Turtle\nformat.\n\nThe CORD-19-on-FHIR dataset is a superset of the CORD-19 dataset,\nand includes the CORD-19 dataset as a subset.  The rest of the\nCORD-19-on-FHIR dataset consists of the CORD-19-on-FHIR data mining\nresults.  The CORD-19-on-FHIR dataset is therefore licensed under two\nlicenses, one license applying to each of the aforementioned subsets:\n\n - The CORD-19 license (copied below from\n   https://ai2-semanticscholar-cord-19.s3-us-west-2.amazonaws.com/2020-03-13/COVID.DATA.LIC.AGMT.pdf) \n   applies to the underlying CORD-19 dataset that is contained (as a\n   translated subset) in the CORD-19-on-FHIR dataset.\n\n - A CC0 license (shown below) applies to the subset of the\n   CORD-19-on-FHIR dataset that expresses the data mining results of the\n   CORD-19-on-FHIR data mining effort, not including the aforementioned\n   CORD-19 data subset.\n\nNote also that these licenses pertain to the aggregate \ndatasets -- not the individual articles that the datasets reference.\nThe individual articles are subject to their own licenses,\nmany of which are listed in the accompanying CSV metadata file at:\nhttps://ai2-semanticscholar-cord-19.s3-us-west-2.amazonaws.com/2020-03-13/all_sources_metadata_2020-03-13.csv\nA \"readme\" for the metadata file is also available at:\nhttps://ai2-semanticscholar-cord-19.s3-us-west-2.amazonaws.com/2020-03-13/all_sources_metadata_2020-03-13.readme\n\n\n================================================================\n                     CORD-19 LICENSE\n================================================================\n\nCOVID DATASET LICENSE AGREEMENT\nBy accessing, downloading or otherwise using any Journals, Articles,\nMetadata, Abstracts, Full-Texts or any other content types provided\nin the COVID-19 Open Research Dataset (CORD-19) Database (the Data),\nYou expressly acknowledge and agree to the following:\n\n - AI2 grants to You a worldwide, perpetual, non-exclusive,\n   non-transferable license to use and make derivatives of the Data for\n   text and data mining only.\n\n - AI2 warrants that it has the right to make the Data available to You\n   as provided for in and subject to this Agreement and in accordance\n   with applicable law. EXCEPT FOR THE LIMITED WARRANTY IN THIS SECTION,\n   THE DATA IS PROVIDED AS IS, WITHOUT ANY WARRANTIES OF ANY KIND.\n\n - You agree to comply with all applicable local, state, national,\n   and international laws and regulations with respect to AI2's license\n   and Your use of the Data.\n\n - Data provided by AI2 is from copyrighted sources of the respective\n   copyright holders. You are solely responsible for Your and Your users'\n   compliance with any copyright, patent or trademark restrictions and are\n   referred to the copyright, patent or trademark notices appearing in the\n   original sources, all of which are hereby incorporated by reference.\n\n\n================================================================\n            CORD-19-on-FHIR Data Mining Subset License\n================================================================\n\nCreative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.\n\n", "type": "File_dump"}, "confidence": 1, "technique": "file_exploration", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/LICENSE"}, {"result": {"value": "This dataset was derived from the CORD-19 dataset, and therefore consists of two subsets, having different licenses, that are intermingled in the CORD-19-on-FHIR dataset:\n\n- the CORD-19 dataset, subject to the CORD-19 license; and\n\n- semantic annotations that were added by CORD-19-on-FHIR data mining, subject to a CC0 license.\n \nSee [LICENSE](https://github.com/fhircat/CORD-19-on-FHIR/blob/master/LICENSE).  By downloading this dataset you are agreeing to the [dataset licenses](https://github.com/fhircat/CORD-19-on-FHIR/blob/master/LICENSE).\n\nSpecific licensing information for individual articles in the dataset is available in the [metadata file](https://ai2-semanticscholar-cord-19.s3-us-west-2.amazonaws.com/2020-03-13/all_sources_metadata_2020-03-13.csv).  See also the [readme for the metadata file](https://ai2-semanticscholar-cord-19.s3-us-west-2.amazonaws.com/2020-03-13/all_sources_metadata_2020-03-13.readme).\n\n- semantic annotations that were added by Pubtator from public domain, using the following public domain notice\n\n\n```text\n# ===========================================================================\n#\n#                            PUBLIC DOMAIN NOTICE\n#               National Center for Biotechnology Information\n#\n#  This software/database is a \"United States Government Work\" under the\n#  terms of the United States Copyright Act.  It was written as part of\n#  the author's official duties as a United States Government employee and\n#  thus cannot be copyrighted.  This software/database is freely available\n#  to the public for use. The National Library of Medicine and the U.S.\n#  Government have not placed any restriction on its use or reproduction.\n#\n#  Although all reasonable efforts have been taken to ensure the accuracy\n#  and reliability of the software and data, the NLM and the U.S.\n#  Government do not and cannot warrant the performance or results that\n#  may be obtained by using this software or data. The NLM and the U.S.\n#  Government disclaim all warranties, express or implied, including\n#  warranties of performance, merchantability or fitness for any particular\n#  purpose.\n===============================================================================\n \n \n```\n", "type": "Text_excerpt", "original_header": "License", "parent_header": ["CORD-19-on-FHIR -- Semantics for COVID-19 Discovery"]}, "confidence": 1, "technique": "header_analysis", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}], "readme_url": [{"result": {"value": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md", "type": "Url"}, "confidence": 1, "technique": "file_exploration"}], "ontologies": [{"result": {"value": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/examples/sample_0036b28fddf7e93da0970303672934ea2f9944e7.json.ttl", "type": "Url"}, "confidence": 1, "technique": "file_exploration"}, {"result": {"value": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/ontologies/covid-19-pico.ttl", "type": "Url"}, "confidence": 1, "technique": "file_exploration"}, {"result": {"value": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/ontologies/ontology.ttl", "type": "Url"}, "confidence": 1, "technique": "file_exploration"}], "has_script_file": [{"result": {"value": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/scripts/fetch_pubtator/pm_json_to_ttl.sh", "type": "Url"}, "confidence": 1, "technique": "file_exploration"}, {"result": {"value": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/scripts/fetch_pubtator/pmc_json_to_ttl.sh", "type": "Url"}, "confidence": 1, "technique": "file_exploration"}], "application_domain": [{"result": {"type": "String", "value": "Semantic web"}, "confidence": 0.9971859991882921, "technique": "supervised_classification"}], "full_title": [{"result": {"type": "String", "value": "CORD-19-on-FHIR -- Semantics for COVID-19 Discovery"}, "confidence": 1, "technique": "regular_expression", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}], "documentation": [{"result": {"type": "Url", "value": "https://github.com/fhircat/CORD-19-on-FHIR/wiki", "format": "wiki"}, "confidence": 1, "technique": "regular_expression", "source": "https://raw.githubusercontent.com/fhircat/CORD-19-on-FHIR/master/README.md"}]}