[
    {
        "title": "PaCTS 1.0: A crowdsourced reporting standard for paleoclimate data",
        "implementation_urls": [
            {
                "identifier": "https://doi.org/10.5281/zenodo.60813",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://doi.org/10.5281/zenodo.60812",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://doi.org/10.5281/zenodo.1245175",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://doi.org/10.5281/zenodo.1205662",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "https://doi.org/10.5281/zenodo.1160672",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            },
            {
                "identifier": "http://doi.org/10.5281/zenodo.2577604",
                "type": "zenodo",
                "paper_frequency": 2,
                "extraction_methods": [
                    {
                        "type": "regex",
                        "location": "",
                        "location_type": "",
                        "source": "",
                        "source_paragraph": ""
                    }
                ]
            }
        ],
        "doi": null,
        "arxiv": null,
        "abstract": "Abstract The progress of science is tied to the standardization of measurements, instruments, and data.This is especially true in the Big Data age, where analyzing large data volumes critically hinges on the databeing standardized. Accordingly, the lack of community‐sanctioned data standards in paleoclimatologyhas largely precluded the benefits of Big Data advances in the field. Building upon recent efforts tostandardize the format and terminology of paleoclimate data, this article describes the PaleoclimateCommunity reporTing Standard (PaCTS), a crowdsourced reporting standard for such data. PaCTS captureswhich information should be included when reporting paleoclimate data, with the goal of maximizing thereuse value of paleoclimate data sets, particularly for synthesis work and comparison to climate modelsimulations. Initiated by the LinkedEarth project, the process to elicit a reporting standard involved aninternational workshop in 2016, various forms of digital community engagement over the next few years,and grassroots working groups. Participants in this process identified important properties acrosspaleoclimate archives, in addition to the reporting of uncertainties and chronologies; they also identifiedarchive‐specific properties and distinguished reporting standards for new versus legacy data sets. This workshows that at least 135 respondents overwhelmingly support a drastic increase in the amount of metadataaccompanying paleoclimate data sets. Since such goals are at odds with present practices, we discuss atransparent path toward implementing or revising these recommendations in the near future, using bothbottom‐up and top‐down approaches.Plain Language Summary Standardizing the way data are described and shared is key toaccelerating the progress of science. Building on recent advances in paleoceanography andpaleoclimatology, we present the first community‐led reporting standard for such datasets. The PaleoclimateCommunity reporTing Standard (PaCTS) provides guidelines as to which information should be includedwhen reporting data from various paleoclimate archives, as well as themes common to many fields, likeuncertainty and other site‐specific information. The ultimate goal of this effort is to (1) make these datasetsmore re‐usable over the long term, and (2) provide a roadmap for implementing and revising the standard,as the field of paleoclimatology and its practitioners both evolve. The requirements are driven by thediffering needs of data producers and the data consumers, who often have different goals in mind. Thus,agreeing on and writing up these requirements involves building consensus among the community to decideon their present and future goals.10.1029/2019PA003632Paleoceanography and PaleoclimatologyKHIDER ET AL.Oxford Brookes University, Oxford, UK, University of Copenhagen, Copenhagen, Denmark, Max Planck Institute forChemistry, Mainz, Germany, Lamont‐8 Doherty Earth Observatory, Columbia University, Palisades, NW, USA157141. IntroductionPaleoclimatology is a highly integrative discipline, often requiring the comparison of multiple data setsand model simulations to reach fundamental insights about the climate system. Currently, suchsyntheses are hampered by the time and effort required to transform the data into a usable formatfor each application. This task, called data wrangling, is estimated to consume up to 80% of researchertime in some scientific fields (Dasu & Johnson, 2003), an estimate commensurate with the experienceof many paleoclimatologists, particularly at the early‐career stage. Wrangling involves not onlyidentifying missing values or outliers in the time series but also searching multiple databases forthe scattered records, contacting the original investigators for the missing data and metadata, andorganizing the data into a machine‐readable format. Further, this wrangling requires an understandingof each data set's originating field and its unspoken practices and so cannot be easily automated or out-sourced to unskilled labor or software. There is therefore an acute need for standardizing paleoclimatedata sets.Indeed, standardization accelerates scientific progress, particularly in the era of Big Data, where data shouldbe Findable, Accessible, Interoperable, and Reusable (FAIR; Wilkinson et al., 2016). Standardization iscritical to many scientific endeavors: efficiently querying databases, analyzing the data and visualizing",
        "publication_date": null,
        "authors": "",
        "file_name": "20250512003002.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/agu_2019/PDFs/20250512003002.pdf",
        "pdf_link": "https://dgarijo.com/papers/agu_2019.pdf"
    }
]