[
    {
        "title": "On specifying and sharing scientific workflow optimization results using research objects",
        "implementation_urls": [],
        "doi": "10.1145/2534248.2534251",
        "arxiv": null,
        "abstract": "ABSTRACTReusing and repurposing scientific workflows for novel scien-tific experiments is nowadays facilitated by workflow repos-itories. Such repositories allow scientists to find existingworkflows and re-execute them. However, workflow inputparameters often need to be adjusted to the research problemat hand. Adapting these parameters may become a dauntingtask due to the infinite combinations of their values in a widerange of applications. Thus, a scientist may preferably usean automated optimization mechanism to adjust the work-flow set-up and improve the result. Currently, automatedoptimizations must be started from scratch as optimizationmeta-data are not stored together with workflow provenancedata. This important meta-data is lost and can neither bereused nor assessed by other researchers. In this paper wepresent a novel approach to capture optimization meta-databy extending the Research Object model and reusing theW3C standards. We validate our proposal through a real-world use case taken from the biodivertsity domain, anddiscuss the exploitation of our solution in the context ofexisting e-Science infrastructures.KeywordsScientific Workflows, Optimization, Research Object, Ontol-ogy, Taverna1. INTRODUCTIONIn recent years scientific workflows have emerged as analternative to script programming for performing in-silicoexperiments. Scientific workflows describe the set of tasksPermission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than theauthor(s) must be honored. Abstracting with credit is permitted. To copy otherwise, orrepublish, to post on servers or to redistribute to lists, requires prior specific permissionand/or a fee. Request permissions from Permissions@acm.org.WORKS13, November 17, 2013, Denver, CO, USACopyright is held by the owner/author(s).Publication rights licensed to ACM.ACM 978-1-4503-2502-8/13/11 ...$15.00http://dx.doi.org/10.1145/2534248.2534251.needed to carry out a computational experiment [5]. Sim-ilar to the ’mashup’ concept in web programming, manyscientific ideas can be phrased as different combinations ofexisting algorithmic building blocks (also known as compo-nents). Scientific workflows have been particularly attractiveto scientists aiming to expose, share and reuse their work [14],as they help specifying the methods used for each step ofthe experiment. Consequentially, e-Science environmentshave started to provide public repositories for collection andsharing of scientific workflows [20] thereby providing a sourcefor large amounts of material for assembling novel methods.",
        "publication_date": "2013-10-23",
        "authors": "Sonja Holl, Daniel Garijo, Khalid Belhajjame, Olav Zimmermann, Renato De Giovanni, Matthias Obst, Carole Goble",
        "file_name": "20250512001124.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/works13/PDFs/20250512001124.pdf",
        "pdf_link": "https://dgarijo.com/papers/works13.pdf"
    }
]