[
    {
        "title": "Lightning Talk:”I solemnly pledge” A Manifesto for Personal Responsibility in the Engineering of Academic Software",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "Abstract— Software is fundamental to academic research work, both as part of the method and as the result of research. In June 2016 25 people gathered at Schloss Dagstuhl for a week-long Per-spectives Workshop and began to develop a manifesto which places emphasis on the scholarly value of academic software and on personal responsibility. Twenty pledges cover the recognition of academic software, the academic software process and the intellectual content of academic software. This is still work in progress. Through this lightning talk, we aim to get feedback and hone these further, as well as to inspire the WSSSPE audience to think about actions they can take themselves rather than actions they want others to take. We aim to publish a more fully devel-oped Dagstuhl Manifesto by December 2016. Index Terms—software, manifesto. I. INTRODUCTION Software is fundamental to academic research work, both as part of the method and as the result of research. With the ad-vent of artifact evaluation committees of conferences, journals that include source code and running systems as part of the published artifacts, as well as the increasing push to reproduci-bility, we foresee that software will only increase in importance as part of the academic process.  In June 2016, 25 people gathered at Schloss Dagstuhl for a weeklong Perspectives Workshop [1] to produce a roadmap towards future professional software engineering for software-based research instruments and other software produced and   This work is licensed under a CC-BY-4.0 license. used in an academic context (i.e., for research, not administra-tion). The group was carefully picked to be broad in its range of disciplines (including Astronomy, Social Sciences, Biology, Chemistry, Computer Science, Physics, and Humanities), roles (including computer science researchers, general and specialist research software engineers and systems administrators) and career stages (from PIs and institute heads to PhD students and postdocs). Despite its ambiguous title, “Engineering Academic Software,” the workshop was on the Engineering of Academic Software (not software for engineers). A Dagstuhl Perspectives Workshop results in a Manifesto. The open science and research software communities have been very active in creating manifestos: the Science Code Man-ifesto [2], Karlskrona Manifesto for Sustainability Design [3], the Reproducibility Manifesto [4], and Principles for Software Citation [5], FAIR data [6], and so on. Why do we need anoth-er Manifesto? First, our manifesto is to be less about what others should do, and more about what we, as individuals, should do. That is, it is more in the style of a personal responsibility pledge like those on open access [7] and open peer review [8]. It is easy for ",
        "publication_date": null,
        "authors": "",
        "file_name": "20250512001453.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/WSSSPE4_paper_15/PDFs/20250512001453.pdf",
        "pdf_link": "https://dgarijo.com/papers/WSSSPE4_paper_15.pdf"
    }
]