[
    {
        "title": "Requirements for Supporting the Iterative Exploration of Scientific Workflow Variants",
        "implementation_urls": [],
        "doi": null,
        "arxiv": null,
        "abstract": "ABSTRACT Workflow systems support scientists in capturing computational experiments and managing their execution.  However, such systems are not designed to help scientists create and track the many related workflows that they build as variants, trying different software implementations and distinct ways to process data and deciding what to do next by looking at previous workflow results.  An initial workflow will be changed to create many new variants thereof that differ from each other in one or more steps. Our goal is to support scientists in the iterative design of computational experiments by assisting them in the creation and management of workflow variants.  In this paper, we present several use cases for creating workflow variants in hydrology, from which we specify requirements for workflow variants.  We also discuss major research directions to address these requirements. CCS CONCEPTS • Information systems → Artificial intelligence; Knowledge representation and reasoning KEYWORDS Scientific workflows, workflow variants, computational experiments 1 INTRODUCTION Scientific workflow systems play a major role in supporting scientists to design, document and execute their computational experiments, automatically tracking provenance during the workflow execution [11; 1]. Scientists follow an iterative exploratory cycle where they often create an initial workflow, and then explore variations of it using different data, replacing some of the software steps, or adding new steps. Sometimes workflows have to be modified because of changes in data (e.g. when datasets are updated with new formats) or software (e.g., software is no longer available, a newer version is better).  In current workflow systems, scientists manage this exploratory process manually. Updating a workflow is a complex and time-consuming task that may involve several steps, and may require tracking down information about different versions of the software used in the workflow.  This paper presents use cases and their requirements to support scientists in the process of exploring different variations of an original workflow, and introduces research directions to address these requirements. These scenarios are based on discussion with domain scientists, particularly in hydrology and bioinformatics.  2 WORKFLOW VARIANTS  Computational workflows describe the computational steps and the dataflow among them to perform complex multi-step analyses. The steps are implemented by software components (or workflow components) that process data. A software component has a well-defined interface consisting of input and output files as well as parameter constant values. The dataflow between components is captured as connections among their respective interfaces. A ",
        "publication_date": null,
        "authors": "",
        "file_name": "20250512000756.pdf",
        "file_path": "../Pruebas/SalidaRSEFCompleta/carvalho_sciknow17/PDFs/20250512000756.pdf",
        "pdf_link": "https://dgarijo.com/papers/carvalho_sciknow17.pdf"
    }
]